[{"id":1,"name":"3 Hwr Doeth","description":"A mysterious hip hop crew from the Caernarfon area, big on lo-fi beats, weird pseudonyms and swearing, 3 Hwr Doeth bring the weirdness and Welsh language rap grubbiness in the best way since cult icons Tystion. Their debut, self-titled album, released on the great Pasta Hull label, is a rowdy 16-tracker, taking in much guest appearances and dissolute living, and which, in Smocio, Hustlo, Dwyn O Tesco, contains both epic title and life motto, whatever lingo you speak.","description_cy":"Hip hop collective o Gaernarfon yw 3 Hwr Doeth, yn arbrofi gyda synau gwahanol ag yn uno eu dylanwadau eclectig i greu rap Cymraeg sy’n ymgorffori elfennau o funk, jazz a blues.","facebook":"https:\/\/www.facebook.com\/3hwrdoeth\/","soundcloud":"https:\/\/soundcloud.com\/3-hwr-doeth","twitter":"https:\/\/twitter.com\/achwmet","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/3-HWR-DOETH-2.jpg"},{"id":2,"name":"Alffa","description":"In these mid-apocalyptic craptimes, you have to hold on to good news when you can, so it’s been majorly heartening to see the unexpected success that’s landed at Alffa’s door recently. Made up of two lads from Llanrug, North Wales, fresh from school, last year Alffa famously became the first band to achieve one million streams of a Welsh language song on Spotify, and now on over 2.8 million for Gwenwyn, a blues rock stomper in Black Keys or White Stripes vein. But there’s more: the rock is strong with these ones; expect a global takeover.","description_cy":"Alffa yw’r band Cymraeg cyntaf yn y byd i gyrraedd 1,000,000 o streams ar Spotify! Ma’r ddeuawd yn ddewiniaid ar greu riffs blues rock trwm a mae’r ddeuawd o Langrug yn barod i gymryd dros y byd, a’r gweddill.","facebook":"https:\/\/www.facebook.com\/alffaband\/","soundcloud":"https:\/\/soundcloud.com\/alffa-band","twitter":"https:\/\/twitter.com\/alffa_band","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Alffa-1.jpg"},{"id":3,"name":"Alien Tango","description":"Bonkers brilliant Spanish electro-pop of the highest order. Supremely eclectic mix of high energy synths, psychedelic disco, glam stomp and latino flourishes. The “Isla Bonita” EP on cult Barcelona label Foehn Records will give you a brief glimpse into his out of this world mindset. This is sure to be one of the most FUN sets of the weekend!","description_cy":"Tu ôl i Alien Tango a’i drôn electrolatin psych mae Alberto Garcia yn cuddio. Cerddor o Sbaen ydyw sy’n byw yn Llundain ond sydd a’i atennas wedi’u cyfeirio at y gofod, y man lle daw ei gerddoriaeth psychelic, glam, hip-hop a’i lais helium-aidd. Rhyddhaodd cyflwynaid o’i EP ar Foehn Records gan gadarnhau mai Alien Tango yw un o greaduriaid gorau’r sin gerddorol yn Llundain.","facebook":"https:\/\/www.facebook.com\/AlienTango\/","soundcloud":"https:\/\/soundcloud.com\/alientangoband","twitter":"https:\/\/twitter.com\/alientangoband","website":"https:\/\/earth-agency.com\/artists\/alien-tango\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Alien-Tango.jpg"},{"id":4,"name":"Amber Arcades ","description":"A well-travelled internationalist, Amber Arcades’ latest album European Heartbreak maybe titled a little painfully for some at this time, but still confirms Annelotte de Graaf as one of the best crafters of lopsided psychedelic dreampop around. Deceptively gentle, European Heartbreak still hides dark corners in its summery meanderings, and follows Wouldn’t Even Know, her Nancy and Lee-style duet with Bill Ryder-Jones, who is also playing this year’s Swn… Whatever happens, everything will be alright for this set at least.","description_cy":"Rhyngwladolydd gyda digon o brofiad teithio tu ôl iddi, mae albwm diweddaraf Amber Arcades ‘European Heartbreak‘ yn dyst i dalent Annelotte de Graaf fel un o grefftwyr pop-breuddwydiol seicedelig gorau sydd o gwmpas. Yn dwyllodrus o dyner, mae European Heartbreak dal i guddio corneli tywyll yn ei hystumiadau hafol, ac yn dilyn y gân Wouldn’t Even Know, ei deuawd gyda Bill Ryder-Jones, sydd hefyd yn chwarae Sŵn eleni.","facebook":"https:\/\/www.facebook.com\/AmberArcades\/","soundcloud":"https:\/\/soundcloud.com\/amber-arcades","twitter":"https:\/\/twitter.com\/AmberArcades","website":"http:\/\/www.amberarcades.net\/?fbclid=IwAR3wsomkQAEaLr32X7DNGOHFJP3wtsNvj6s6mmQDoRhUu-VPDpqQ-Sm99GY","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Amber-Arcades-2.jpg"},{"id":5,"name":"Ani Glass","description":"One of the most anticipated events of 2019, in the more discerning parts at least, is the debut album from Ani Saunders. Since 2016, having left pop modernists The Pipettes, Glass has been releasing electronic tracks laced with quiet drama, with Perianaeth Perffaith, all ice vocals and synth swooning, one of last year’s best. Now, her recent MA in Urban and Regional Development has informed a forthcoming album of modern city songs: gleaming, frantic and celebratory.","description_cy":"Un o artistiaid oddi ar y label arbrofol o gaerdydd, Recordiau Neb yw Ani Glass. Does dim diwedd i allbynnau creadigol Ani Glass, yn o gystal a sgwennu cerddoriaeth pop electronig, mae hi hefyd yn cynhyrchu ei cherddoriaeth i gyd ag yn arlunydd a ffotograffydd brwd. “Cerddoriaeth ar gyfer diwedd y byd, a dechrau un newydd” meddai Laura Snapes o Pitchfork.","facebook":"https:\/\/www.facebook.com\/aniglasscymru\/","soundcloud":"https:\/\/soundcloud.com\/aniglass","twitter":"https:\/\/twitter.com\/Ani_Glass","website":"http:\/\/www.recordiauneb.com\/ani-glass","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Ani-Glass.jpg"},{"id":6,"name":"Asha Jane","description":"Asha Jane is and explorative artist that experiments with delivery, form and audience. A true performer that shape-shifts from one world to another, Asha Jane will sometimes be caught on stage with intricate wings, installed art pieces or mythological decor on stage. ","description_cy":"Artist chwilfrydig yw Asha Jane sy’n arbrofi gyda chynulleidfa, ffurf a pherfformiad. Yn berfformwraig sy’n neidio o un blaned i’r llall, gellir weld Asha Jane ar lwyfan gyda darnau celf, rhyw fath o decor mytholegol neu hyd yn oed yn gwisgo adennydd. Gyda’i llais anhygoel a dynamig, mae Asha Jane yn llwyddo creu sŵn sy’n llawn teimlad a sy’n sicr o’ch hudo. ","facebook":"https:\/\/www.facebook.com\/AshaJaneMusic\/","soundcloud":"https:\/\/soundcloud.com\/ashajane","twitter":"https:\/\/twitter.com\/TheAshaJane","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Asha-Jane.jpg"},{"id":7,"name":"audiobooks","description":"Trippy story-telling through haunted, blasé vocals over a bed of moorish electronics. This is the sound of Audiobooks. Another unique gem offered by Heavenly Recordings. The duo’s debut album, ‘Now! (in a minute)’ is centred around strange short stories that Evangeline Ling would save in her text message drafts that genius producer David Wrench wanted to collaborate on. What’s delivered is an impressive collection of beautifully disfigured pop songs. Audiobooks create experimental pop at it’s most intense. Come get hypnotized.","description_cy":"Llais achlysurol yn adrodd straeon trippy dros wely o synau electroneg caethiwus. Dyma swn unigryw audiobooks. Perl prydferth arall o deulu Heavenly Recordings. Fe rhyddhawyd y ddeuawd eu album cyntaf ‘Now! (In A Minute)’ llynedd. Mae’r album wedi’i seilio ar straeon byrion cantres y band, Evangeline Ling a gwaith electroneg y cynhyrchydd eiconig, David Wrench. Beth sy’n cael ei gyflwyno yw casgliad trawiadol o ganeuon pop wedi’i ddadadeiladu. Mae audiobooks yn creu y pop arbrofol mwya dwys yn y bydysawd – dewch i gael eich hudoli.","facebook":"https:\/\/www.facebook.com\/audiobookshq\/","soundcloud":"https:\/\/soundcloud.com\/audiobookshq","twitter":"https:\/\/twitter.com\/audiobooks_hq","website":"https:\/\/www.audiobookshq.co.uk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Audiobooks.jpg"},{"id":8,"name":"Bambara","description":"A shot of pure dark stuff from this Brooklyn trio, who started in Athens, Georgia and brought all that Southern Gothic creepiness into their pitch black noise rock. Based around the twin brothers of Reid and Blaze Bateh (also the backing band for the most recent Liars tour), on three albums Bambara have created a pulverising mix of twisted garage rock, mutant rockabilly and perverse storytelling, like Health, the Birthday Party and Swans playing a dive bar in a David Lynch film. And they do a mean Kate Bush cover.","description_cy":"Bydd y triawd o Frooklyn a ddechreuodd yn Athens, Georgia yn dod â roc tywyll, Gothic ysgytwol a thywyll i Gaerdydd. Mae’r ddau efaill Reid a Blaze Bateh (sydd hefyd yn rhan o fand cefndirol y daith Liars) wedi creu tri albym sy’n uno roc garej, rocabili rhyfedd a’r ddawn o ddweud stori i’r dim. Ma nhw hefyd yn neud cyfyr gwych o gân gan Kate Bush. ","facebook":"https:\/\/www.facebook.com\/BAMBARA.band\/","soundcloud":"https:\/\/soundcloud.com\/bambaraband","twitter":"https:\/\/twitter.com\/BambaraBand","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Bambara.jpg"},{"id":9,"name":"Bess Atwell","description":"From her name to the bewitching purity of her vocal style, there’s something out-of-time about Bess Atwell, an otherworldliness that’s nearer to 50 or 100 years ago than the present. A young folk singer from the South Downs, Atwell came to prominence with 2016’s Hold Your Mind, a collection of songs that added minimal backing to clear melodies reminiscent of Joni Mitchell or Laura Marling. 2018’s new tracks Grace and Swimming Pool add a little full band shading to their lilting phrases, and set the bar high for a stellar 2019.   ","description_cy":"Mae Bess Atwell yn arbenigwr ar greu harmonïau syfrdanol drwy ei cherddoriaeth gwerin cyfoes. Mae ei cherddoriaeth bregus a swynol yn haeddu’ch sylw.","facebook":"https:\/\/www.facebook.com\/bessatwellmusic\/","soundcloud":"https:\/\/soundcloud.com\/bessatwell","twitter":"https:\/\/twitter.com\/BessAtwell","website":"http:\/\/bessatwell.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Bess-Atwell.jpg"},{"id":10,"name":"Big Joanie","description":"After supporting kindred spirits Bikini Kill for two sold out nights at the Brixton Academy as well as tours with the likes of Shopping and Parquet Courts their star seems very much in the ascendancy. Debut album “Sistahs” (released late last year on Thurston Moore et al’s new label) confirmed their status as undisputed Queens of the London DIY punk scene and far beyond.","description_cy":"Band pync, ffeinyddol, groenddu yw Big Joanie. Ma’ nhw fel The Ronettes wedi’i hidyllu trwy sîn DIY yr 80au a Riot Grrrl y 90au, gyda chydig bach o dashikiswedi’i daflu ar eu pennau. Ffurfiodd Big Joanie yn Llundain yn Haf 2013 er mwyn perfformio yn First Times ac yn 2016, rhyddhaodd y band sengl wych o’r enw ‘Crooked Room’ ar eu label ei hun. Erbyn hyn yn un o selogion y sin pync DIY yn Llundain, maent wedi bod yn teithio o gwmpas Ewrop yn cefnogi bandiau fel Downtown Boys, Shopping, Parquet Courts a llawer mwy.","facebook":"https:\/\/www.facebook.com\/bigjoanie\/","soundcloud":"https:\/\/soundcloud.com\/big-joanie","twitter":"https:\/\/twitter.com\/Big_Joanie","website":"https:\/\/bigjoanie.tumblr.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Big-Joanie.jpg"},{"id":11,"name":"Big Thing","description":"A band as new and shiny as the music they create, Cardiff’s Big Thing may be barely three online songs old, but are already making big impressive strides. On Freaking Out they channel pure singalong guitar pop, halfway between ‘80s jangle and summery ‘90s Britpop, while on Spin Big Thing prove equally adept at slowing and expanding their sound, dialing up the shoegaze guitars and epic melodies. Watch them fly.","description_cy":"Pedwarawd o Gaerdydd yw Big Thing sy’n canu caneuon pop scuzzy am gariad, colled a nosweithiau lletchwith fyse’n teimlo’n gartrefol rhwng bandiau dreampop, shoegaze ag amgen y 90’au.","facebook":"https:\/\/www.facebook.com\/bigthingband\/","soundcloud":"https:\/\/soundcloud.com\/bigthingband","twitter":"https:\/\/twitter.com\/bigthingband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Big-Thing.jpg"},{"id":12,"name":"Bilge Pump","description":"A sporadic but vital presence in both the Leeds and underground noise rock scenes, Bilge Pump recently released We Love You, their first album for ten years, and a slap in the chops reminder of their greatness. Though they never really went away: cropping up in toilet gigs and Marc Riley sessions, Bilge Pump sets are a fabulous mixture of scabrous avant-rock rhythms, sideways guitar noise and absurdist Northern humour, as addictive as your mate’s pub’s lock in. Even their Wikipedia page is top. The Mighty Bilge Pump, as someone would say.","description_cy":"Yn bresenoldeb ysbeidiol ond hanfodol yn Leeds a sŵn y sîn roc tanddaearol, rhyddhaodd Bilge Pump We Love You, eu halbym cyntaf ers deng mlynedd, yn albym sy’n atgoffa pawb o’u mawredd. Er iddynt erioed ddiflannu yn gyfan gwbl, wrth ymddangos mewn gigs toiled a sesiynau Marc Riley, mae Bilge Pump yn gyfuniad gwefreiddiol o rythmau avant-rock, sŵn gitâr ysblennydd a hiwmor gogleddol hurt, maent yr un mor gaethiwus â lock in mewn tafarn dy ffrind. Mae eu tudalen Wikipedia hyd yn oed yn wych. The Mighty Bilge Pump, ys dywed rhai...","facebook":"https:\/\/www.facebook.com\/TheMightyBilgePump\/","soundcloud":"https:\/\/soundcloud.com\/bilgepump","twitter":"https:\/\/twitter.com\/MightyBilgePump","website":"http:\/\/www.gringorecords.com\/artist.php?artistid=3","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Bilge-Pump.jpg"},{"id":13,"name":"Bill Ryder-Jones","description":"A founder member of Merseyside band The Coral when he was still in school, since 2008 Bill Ryder-Jones has quietly flourished as a solo artist of great variety and style. His debut album If… was all instrumental beauty and appearances from the Liverpool Philharmonic Orchestra, while A Bad Wind Blows In My Heart, his second, embraced a slowburn style, touching on Smog or Red House Painters. More albums followed, heavier, folkier, while Ryder-Jones also completed small-scale film scores and production work. An adept cataloguer of life behind curtained windows, it’s a body of work that can only expand in fascinating ways.","description_cy":"Un o sylfaenwyr Merseyside band The Coral pan oedd yn yr ysgol, ers 2008 mae Bill Ryder-Jones wedi blodeuo’n dawel fel artist unigol gydag amrywiaeth a steil. Roedd ei albwm cyntaf If… yn gampwaith offerynnol gyda pherfformiadau gan Gerddorfa Ffilharmonig Lerpwl, tra bod A Bad Wind Blows In My Heart, ei ail albym yn cofleidio ei steil araf-losgi, yn cyffwrdd ar Smog neu Painters Red House. Yna daeth mwy o albymau trymach a gwerinol, wrth i Ryder-Jones gwblhau cyfansoddi cerddoriaeth ar gyfer ffilmiau a gwaith cynhyrchu. Cawn yma gorff o waith sydd am ehangu a datblygu mewn ffyrdd diddorol a hudol. ","facebook":"https:\/\/www.facebook.com\/bryderjones\/","soundcloud":"https:\/\/soundcloud.com\/bill-ryder-jones","twitter":"https:\/\/twitter.com\/BRyderJones","website":"http:\/\/billryderjones.co.uk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/BillRyderJones-1.jpg"},{"id":14,"name":"Black Country, New Road","description":"A sprawling 6-piece transplanted from Cambridge to London, BCNR make an excellently uncategorizable brew of strung out post rock and spoken word, psychodramas topped with violin, sax and general anguish. Debut single Athen’s, France, another of Speedy Wunderground’s stream of limited 7” releases, has it all: a creepy, sardonic tale unfolding over shifting tempos, pushing and pulling into crunches reminiscent of Slint or Godspeed, for six unsettling minutes. London’s best and most enigmatic new band for a reason.","description_cy":"6awd a thrawsblannodd o Cambridge i Lundain, mae BCNR yn creu miwsig ddi-categori anhygoel mewn llinyn o lafarganu ôl-roc, fiolinau dramatig, sacsoffon a gofid cyffredinol. Mae gan y sengl début Athen’s, France, popeth chi angen: chwedl iasol sy’n datblygu dros dempo symudol, yn gwthio a thynnu a chrensio yn debyg i Slint neu Godspeed, am 6 munud ansefydlog. Band newydd gorau a fwyaf enigmatig am reswm.","facebook":"https:\/\/www.facebook.com\/BlackCountryNewRoad\/","soundcloud":"https:\/\/soundcloud.com\/user-373900992","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Black-Country-1.jpg"},{"id":15,"name":"Bloxx","description":"Bloxx’s pop-heavy indie hooks are impossible to dislodge and ridiculously moreish. A still-young fourpiece from Uxbridge, West London, early singles Your Boyfriend and You garnered the attention of Annie Mac and Huw Stephens, and landed plum support slots with the Wombats and Sundara Karma. Revolving around singer Orphelia’s ability to quickly flip from laidback to impassioned, recent songs like Headspace also show a nice ‘80s direction, leading to shrewd bets for Bloxx to ‘do a Paramore’ in 2019.","description_cy":"Rhybudd sŵn: bydd yn barod i bacio dy blygs clustiau wrth fynd i weld band newydd gorau Caerdydd. Yn cynnwys aelodau o Exit_International a Salt Bath gyda llais anhygoel Amber Efstathiou, er mai dim ond un tap demo mlwydd oed yw’r ffrwydriad ysgytwol yma o fand mae eu perfformiadau byw yn tanlinellu’r hyn rydym yn delio ag ef: sŵn ffyrnig a gwyllt sy’n pryfocio, cylchu ac yna’n chwalu dy wyneb. Paid a meiddio bod yng nghefn yr ystafell ar gyfer y perfformiad yma.","facebook":"https:\/\/www.facebook.com\/BloxxUK\/","soundcloud":"https:\/\/soundcloud.com\/bloxxband","twitter":"https:\/\/twitter.com\/bloxxband","website":"https:\/\/www.musicglue.com\/bloxx\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Bloxx.jpg"},{"id":16,"name":"Bodyhacker","description":"Noise alert: earplugs and neck stretches ready for the best new band in Cardiff right now. A piledriving blast featuring members of Exit_International and Salt Bath, with the blistering vocals of Amber Efstathiou up front, Bodyhacker may only be one demo tape old in online terms, but live shows underline what we’re dealing with here: fierce and feral noise rock that teases, circles then smashes you in the face. Don’t be at the back for this.","description_cy":"Rhybudd sŵn: bydd yn barod i bacio dy blygs clustiau wrth fynd i weld band newydd gorau Caerdydd. Yn cynnwys aelodau o Exit_International a Salt Bath gyda llais anhygoel Amber Efstathiou, er mai dim ond un tap demo mlwydd oed yw’r ffrwydriad ysgytwol yma o fand mae eu perfformiadau byw yn tanlinellu’r hyn rydym yn delio ag ef: sŵn ffyrnig a gwyllt sy’n pryfocio, cylchu ac yna’n chwalu dy wyneb. Paid a meiddio bod yng nghefn yr ystafell ar gyfer y perfformiad yma.","facebook":"https:\/\/www.facebook.com\/bodyhackerband\/","soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Bodyhacker.jpg"},{"id":17,"name":"Brand New Friend","description":"Super-infectious buzzsaw pop from Castlerock, Northern Ireland, Brand New Friend formed around brother\/sister duo Lauren and Taylor Johnson, and quickly started winning hearts through their irrepressible, impossible-to-dislodge tunefulness. A tsunami of hooks that mixes the direct garage punk of Buzzcocks or Undertones with the college rock melodicism of someone like The Thermals, BNF songs are tight, thrashy and, when those sibling vocals merge, achieve lift off more often than not. ","description_cy":"Mae’r ddeuawd brawd a chwaer o Ogledd Iwerddon; Lauren a Taylor Johnson wedi ennill sawl calon gyda’u tiwns buzzsaw pop anadferadwy a heintus. Mae Brand New Friend yn taflu tonnau enfawr o hooks sy’n cymysgu garage punk Buzzcocks a Undertones gyda roc-coleg melodig The Thermals. ","facebook":"https:\/\/www.facebook.com\/brandnewfriendmusic\/","soundcloud":"https:\/\/soundcloud.com\/brandnewfriend","twitter":"https:\/\/twitter.com\/brandnewfriendz","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Brand-New-Friend.jpg"},{"id":18,"name":"Bryde","description":"Since leaving folk duo Paper Aeroplanes, then collaborating as vocalist on a number of trance singles, Sarah Howells is stepping out as sole owner of Bryde, shorn of other members but with her loudest, most powerful material yet. If you haven’t seen the video for To Be Brave yet, please rectify immediately: as Howells steps over wintry, windblown landscapes, guitars chime and build towards a quietly devastating, string-aided climax. The debut Bryde LP Like An Island has more – this is emotional heft and quiet confidence far removed from any dull ‘singer-songwriter’ tag you dare apply.","description_cy":"Ers gadael y ddeuawd werin Paper Aeroplanes, ac yna’n cydweithio fel canwr ar nifer o draciau trance, mae Sarah Howells yn camu mas fel arweinydd solo Bryde, ond gyda’i deunydd mwyaf pwerus a chryf eto. Os nad ydych chi wedi gweld y fideo am To Be Brave eto, ewch i’w weld ar unwaith!","facebook":"https:\/\/www.facebook.com\/brydeofficial\/","soundcloud":"https:\/\/soundcloud.com\/brydemusic","twitter":"https:\/\/twitter.com\/brydeofficial","website":"http:\/\/www.brydemusic.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Bryde.jpg"},{"id":19,"name":"Campfire Social","description":"Epic, emotional, melancholic but uplifting indie rock. This Llangollen collective will have fans of Frightened Rabbit, Broken Social Scene etc. dancing and crying into their pints at the same time. After playing festivals as far afield as South Korea and Canada we welcome them back to Cardiff with open arms and a fuzzy warm glow that seems to be eagerly reciprocated in every note.","description_cy":"Mae Campfire Social yn creu sŵn cyfoethog gyda harmoniau llachar, hyfryd a melodïau synfyfyriol. Mae eu hagwedd onest yn adlewyrchu cariad a diwylliant emo y 90au. Caneuon sy’n sobri’r meddwl ond yn mynnu rhoi un neges bwysig, ry’n ni’n well gyda’n gilydd. Cafodd eu EP diweddaraf ‘Wellbeing’ ei roi ar Rhestr A BBC Radio Wales gan sicrhau cefnogaeth barhaol gan BBC 6 Music a sesiwn byw gyda Janice Long.","facebook":"https:\/\/www.facebook.com\/campfiresocialmusic\/","soundcloud":"https:\/\/soundcloud.com\/campfiresocial","twitter":"https:\/\/twitter.com\/campfire_social","website":"https:\/\/www.bbc.co.uk\/programmes\/profiles\/3L3QTBrfGnvRvJLwtc4Tndb\/campfire-social","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Campfire-Social.jpg"},{"id":20,"name":"Casi","description":"One foot in Celtic mysticism and Welsh folksong, one in the world of crisp electronic beats, Casi Wyn, on the evidence of recent EP ‘Sunflower Seeds’, has created a dazzling and fascinating space between ancient and modern. Inspired by Casi’s return from London to her Welsh homeland, it’s music that swells with strings and sweeping vocals, magical, almost alien stuff that transports the mountaintops to the dancefloor. ","description_cy":"Yn dilyn rhyddhau eu EP diweddaraf ‘Sunflower Seeds’ mae Casi Wyn wedi creu gofod diddorol a hollol unigryw rhwng yr hen a’r newydd yn pontio chwedlau Celtaidd, caneuon traddodiadol Cymreig â churiadau electronig miniog.  Wedi’i hysbrydoli ar ôl dychwelyd yn ôl o Lundain i’w mamwlad – Cymru, mae’r gerddoriaeth yn gorlifo mewn llinynnau swynol a lleisiau hyfryd, hudolus ac estronaidd sy’n dod a mynyddoedd Eryri i’r llawr ddawnsio. ","facebook":"https:\/\/www.facebook.com\/casiandtheblindharpist\/","soundcloud":"https:\/\/soundcloud.com\/casi","twitter":"https:\/\/twitter.com\/casi","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Casi.jpg"},{"id":21,"name":"Charlotte Adigery","description":"Intensively playful, supremely expensive pop music from this Belgian-Caribbean artist. Charlotte Adigery creates music that’s slinky and moreish (‘High Lights’, about her love of wigs), a delicious rush of Creole smoothness (‘Patenipat’), or the occasional overload of ASMR-triggering sound effects (‘Cursed And Cussed’, will make your head explode). Sometimes produced and released by the Dewaele brothers from Soulwax and 2ManyDJs, Adigery is a total package of brains and thrills, hooks and class.","description_cy":"Mae EP newydd y cerddor Belg-Carabiaidd – Charlotte Adigery ‘Zandoli’ yn profi bod gan y ferch dalentog yma ffordd arbennig o ddweud stori. Weithiau’n hollol wirion, weithiau’n hollol ddifrifol, mae meddwl Adigery yn crwydro a chwyrlio o gwmpas straeon a chwedlau abswrd, teimladwy a llawn hwyl. Wedi’i dysgu gan ei mam (a gafodd ei geni yn Martinique) mae perthynas y rhythm a’r gerddoriaeth a phwysigrwydd hiwmor – yn sicrhau fod Adigery yn gerddor argyhoeddiadol ifanc sy’n gallu canu am fadfalloedd mewn un cân a latex yn yr un nesaf.","facebook":"https:\/\/www.facebook.com\/charlotteadigery\/","soundcloud":"https:\/\/soundcloud.com\/charlotteadigery","twitter":"https:\/\/twitter.com\/adigerwww","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Charlotte-Adigery.jpg"},{"id":22,"name":"Chastity Belt","description":"Probably the coolest bunch of mates to pick up guitars and form a band, since 2013’s ‘No Regrets’, Seattle-based Chastity Belt have been issuing a high grade stream of whip-smart indie rock, three albums of brash and chilled and intelligent music. A product of the great Pacific North West DIY scene (singer Julia Shapiro is also in the excellent Childbirth with Tacocat’s Bree McKenna), CB songs cover ground from sex positivity to hometown pride with inclusive toughness and stoned wit. It’s good to have them back.","description_cy":"Ychydig o flynyddoedd yn ôl, tra ar daith rhywle yn Idaho, aeth aelodau’r band Chastity Belt ati ladd amser mewn ffordd anarferol – penderfynnnon nhw i ganmol ei gilydd gan feddwl yn ddwys ac mewn manylder am yr hyn oedden nhw’n dweud. Gan eu bod mor onest a mor agos fel band, mae’r egni a’r perthynas arbennig yma yn disgleirio trwy eu caneuon. Rhyddhawyd eu trydydd albym ‘I Used to Spend So Much Time Alone’ yn Ngorffennaf 2016, albym ôl-bync, tywyll a hardd sy’n llawn hiwmor rhyfedd – ewch i wrando arno nawr!","facebook":"https:\/\/www.facebook.com\/chastitybeltmusic\/","soundcloud":"https:\/\/soundcloud.com\/chastity-belt","twitter":"https:\/\/twitter.com\/CHAST1TYBELT","website":"http:\/\/chastitybeltmusic.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Chastity-Belt.jpg"},{"id":23,"name":"CHROMA","description":"A celebratory fixture amongst the bigger gigs and awards ceremonies of South Wales, Pontypridd’s Chroma get a little bigger, a little stompier every year. Led by the fierce and charismatic Katie Hall, Chroma music is the type of glam garage rock that struts and bounces, a totally inclusive pop party best displayed in the recent single Girls Talk: three minutes of Yeah Yeah Yeahs-level brashness and cool. They may be unstoppable.","description_cy":"Yn dilyn perfformio mewn gigs a seremonïau dros Dde Cymru, mae Chroma o Bontypridd, yn cryfhau ac yn aeddfedu ychydig mwy bob blwyddyn. Wedi’u harwain gan y ferch ffyrnig a charismatig, Katie Hall, mae cerddoriaeth Chroma yn glam roc garej sy’n bownsio a ffrwydro, parti pop cwbl gynhwysol sy’n cael ei ddathlu a’i arddangos orau yn ei sengl Girls Talk: tri munud o cŵl. Gall neb stopio Chroma.","facebook":"https:\/\/www.facebook.com\/CHROMAbanduk\/","soundcloud":null,"twitter":"https:\/\/twitter.com\/CHROMAbanduk","website":"https:\/\/www.chroma.band","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Chroma.jpg"},{"id":24,"name":"Claque (THE)","description":"Since leaving scabrous noise merchants Girl Band in 2017, guitarist Alan Duggan hooked up with fellow Dublin pals Kate Brady and Paddy Ormond to form The Claque. The crunchy, industrial guitar tone remains, but The Claque are very much their own thing: debut single ‘Hush\/Stray’ is a great rattle of drum machines and shifting noise, Brady’s clipped and strident vocals meshed with alien soundscapes. Brand new, do not miss.","description_cy":"The Claque yw Alan Duggan, Kate Brady a Paddy Ormond. Hen ffrindiau o Ddulyn sy’n wynebau cyfarwydd i sîn y ddinas. Dechreuodd y prosiect yn 2017 gyda’r bwriad o blethu sawl elfen a chwaeth gerddorol i greu cerddoriaeth sy’n haentus a heriol.","facebook":"https:\/\/www.facebook.com\/theclaqueband\/","soundcloud":null,"twitter":"https:\/\/twitter.com\/theclaqueband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/The-Claque.jpg"},{"id":25,"name":"Clwb Fuzz","description":"Post-punk garage rock band, formed at University of South Wales in Cardiff. Influences include My Bloody Valentine, The Pixies, Smashing Pumpkins and Sonic Youth.","description_cy":"Band ôl-bync, roc garej a ffurfiwyd ym Mhrifysgol De Cymru yng Nghaerdydd. Gyda dylanwadau gan My Bloody Valentine, The Pixies, Smashing Pumpkins a Sonic Youth. ","facebook":"https:\/\/www.facebook.com\/clwbfuzz\/","soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Clwb-Fuzz.jpg"},{"id":26,"name":"Comet is Coming (THE)","description":"An epic, interplanetary meeting between cosmic saxman Shabaka Hutchings of modernist jazz icons Sons Of Kemet, and Dan and Max of pounding synths and drums outfit Soccer96, The Comet Is Coming have been bringing the galactic dance party since 2013. A wild brew of distorted funk, jazz and feral electronica, latest album Trust in the Lifeforce of the Deep Mystery is another spectrum of far out sounds, and shows again why they’re such a vital, brutal, hands-up-in-another-dimension live draw. ","description_cy":"Cyfarfod epig, rhyngblanedol rhwng chwaraeydd sacsoffon Shabaka Hutchingo’r eicon jazz modern ‘Sons of Kemet‘ a Dan a Max o Soccer96 sydd ar y synth a’r dryms. Mae The Comet Is Coming wedi bod yn dod a’r parti dawnsio rhyngblanedol i’n clustiau ers 2013. Yn gawl gwallgof o distorted funk, jazz a electronica gwyllt, mae’r albym ddiweddaraf ‘Trust in the Life Force of the Deep Mystery‘ ar y sbectrwm o synau sydd tu hwnt i’r byd yma, sy’n dangos pam eu bod yn fand byw anghredadwy, creulon a chwyldroadol.","facebook":"https:\/\/www.facebook.com\/thecometiscoming\/","soundcloud":"https:\/\/soundcloud.com\/thecometiscoming","twitter":"https:\/\/twitter.com\/cometcoming","website":"http:\/\/www.thecometiscoming.co.uk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Comet-is-Coming.jpg"},{"id":27,"name":"Conchúr White","description":"Previously the frontman for Portadown indie folk band Silences, and the face of a campaign promoting UK music on a fleet of Chinese buses (!), Conchúr White’s nascent solo work has a stripped back, haunting quality, White’s delicate vocals picking out the melody, drifting into occasional falsetto. It’s sparse and beautiful stuff, and recent trips to New York to work with Kevin McMahon (Frightened Rabbit, Real Estate) hint at a return to full band lushness, and promise quietly devastating music to come. ","description_cy":"Mae gwaith solo Conchúr White yn eginol a noeth, gyda ansawdd iasol a chain gyda’i lais yn pigo’r melodi ag yn llifo’n mewn i falsetto bob hyn a hyn. Cerddoriaeth prydferth a tenau sy’n cael ei gynnig a mae’n hawdd deall pam bod gymaint yn cael eu syfrdanu ganddo. Mae White wedi bod yn teithio i Efrog Newydd yn ddiweddar i weithio gyda Kevin McMahon (Frightened Rabbit, Real Estate) sy’n awgrymu bod e’n barod i ddychwelyd gyda band llawn a mwy o gerddoriaeth. ","facebook":"https:\/\/www.facebook.com\/conchur.white\/","soundcloud":null,"twitter":"https:\/\/twitter.com\/ConchurWhite","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Conchur-White.jpg"},{"id":28,"name":"County Line Runner","description":"Songwriter Adam Day (formerly of Lyrebirds) combines the driving epic stadium Americana rock sensibilities of a Springsteen, a Petty or a Fallon with a very British sense of  introversion, nostalgia and honesty. Simultaneously yearning for a more innocent past and hoping for a brighter future. Timeless songwriting that somehow feels very very Now.","description_cy":"Mae alter ego y cerddor Adam Day, County Line Runner yn llwyddo i adlewyrchu cyfnod mewn amser ym mhob cân gan rhoi darn o’i hun mewn i bob cyfansoddiad. Erbyn hyn mae ei ganeuon cyntaf ‘Hard to Find’ a ‘Wide Eyes’ wedi’u ffrydio dros miliwn o weithiau ar Spotify ac wedi sicrhau cefnogaeth gan Clash Magazine, BBC Music a llawer mwy.","facebook":"https:\/\/www.facebook.com\/countylinerunner\/","soundcloud":"https:\/\/soundcloud.com\/countylinerunner","twitter":"https:\/\/twitter.com\/the__CLR","website":"http:\/\/countylinerunner.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/County-Line-Runner.jpg"},{"id":29,"name":"Creatures","description":"With summery harmonies, spaghetti western riffs, groovy surf rock and retro backing vocals of oohs and lahs – Creatures are geared up to soundtrack your next road trip in a VW camper.  Formed in 2016, this vintage pop rock outfit drench their velvety 60s sound with warm sepia tones, like a waltz between The Doors and The Beatles. This is a band that’s perfected their sound well in advance, so they can enjoy the journey – hop in for the next stop.","description_cy":"Gyda harmoniïau hafaidd, riffs o’r spaghetti westerns, surf rock groovy a digonedd o oohs a lahs – mae gan Creatures y cynhwysion i greu trac sain i’ch road trip nesaf yn y VW campervan yna. Dyma fand sydd wedi perffeithio’u swn yn gynnar yn y gêm er mwyn medru mwynhau’r daith – hopiwch ymlaen ar gyfer y stop nesaf.","facebook":"https:\/\/www.facebook.com\/creaturesofficial\/","soundcloud":"https:\/\/soundcloud.com\/creaturesband","twitter":"https:\/\/twitter.com\/creaturesbanduk","website":"https:\/\/creaturestheband.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Creatures.jpg"},{"id":30,"name":"Cruelty","description":"Not even a year old and already handpicked by Idles to play their homecoming aftershow party, Bristol’s Cruelty are at the darker end of the guitar spectrum, playing bruisingly intense goth-laced rock. Debut single Disgraced flies past in two hectic minutes, a taut one-chord howl that finally bursts open, then stops dead. There will be more.","description_cy":"Nid ydynt hyd yn oed yn flwydd oed ac mae Idles eisoes wedi eu dewis i chwarae yn eu parti ôl-sioe adref yn Mryste, mae Cruelty ar ben tywyllaf y sbectrwm gitâr, yn chwarae roc goth, dwys a chreulon. Mae ei sengl cyntaf ‘Disgraced’ yn pasio mewn dwy funud cythryblus, yn un cord mawr sy’n ffrwydro ar agor, yna’n syrthio’n farw. Mae mwy i ddod gan Cruelty.  ","facebook":"https:\/\/www.facebook.com\/bandofcruelty\/","soundcloud":"https:\/\/soundcloud.com\/user-833685135","twitter":"https:\/\/twitter.com\/bandofcruelty","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Cruelty.jpg"},{"id":31,"name":"Darren Eedens & The Slim Pickin’s","description":"PSA: it’s compulsory to sip rye whiskey during this set. That or moonshine: Eedens is the folk and bluegrass troubadour par excellence, a banjo, fine moustache and an armoury of party songs and murder ballads. Originally from Ontario and now ensconced in Cardiff, Eedens has his Slim Pickins around him, tea chest bass and fiddle solo ready, and furious plucking and hoedown fun will be everyone’s. ","description_cy":"Yn wreiddiol o Gandada mae Darren Eedens wedi dod a’i ddylanwadau Americana a chanu gwlad i’w gartref newydd yma yng Nghaerdydd. Ar ôl casglu cerddorion lleol at ei gilydd, tyfodd y dylwanwadau a chwalwyd rheolau a ffiniau. Gyda David Grubb ar y ffidl, Rhys Morgan ar y bass a Edd Clemas ar y dryms mae’r band yn ffrwydraid egniol o banjo’s a gitar mewn arddull bluegrass. ","facebook":"https:\/\/www.facebook.com\/darreneedensmusic\/","soundcloud":"https:\/\/soundcloud.com\/darreneedens","twitter":"https:\/\/twitter.com\/darreneedens","website":"http:\/\/www.darreneedensandtheslimpickins.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Darren-Eedens.jpg"},{"id":32,"name":"Dehd","description":"A product of Chicago’s tight-knit and incestuous DIY scene, the three members of Dehd came together in 2015, and quickly turned heads with their sparse and raw take on trebly guitar rock. Held down by Eric McGrady’s minimal drumkit thump, bassist Emily Kempf and guitarist Jason Balla pinball off each other, the latter howling and drawling over spooky Americana that recalls fellow cultists like The Cramps or Shannon And The Clams. Get converted.","description_cy":"Cariad yw hud sy’n cael ei brofi bob dydd. Dyma’r neges y cawn ar ôl gwrando ar Water, albym newydd y triad o Chicago, Dehd. Mae’r cariad hwnnw yn codi i’r awyr fel stêm oddi ar balmant ar ddiwrnod braf. Mae’r cariad hwnnw hefyd yn torri eich calonnau, ond fe ddylsech chi deimlo’n lwcus i brofi fath deimlad. Dyma’r fath o beth darganfyddodd Jason Balla, Emily Kempf a Eric McGrady – Dehd nôl yn 2014 pan ffurfiodd y band. Mae Balla a Kempf yn rhan anatod o’r sîn DIY ffrwythlon yn Chicago. Pan ymunodd y ddau a’i gilydd gan dynnu ei ffrind Eric McGrady i’r arbrawf, darganfyddodd y tri bod ganddynt berthynas rhyfedd ac anesboniadwy….","facebook":null,"soundcloud":"https:\/\/soundcloud.com\/dehdchi","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Dehd.jpg"},{"id":33,"name":"Denuo","description":"A mysterious North Walian presence seemingly dormant for years at a time, Denuo revolves around multi-instrumentalist Tom Mason, and his knack for tender, evocative cocoons of guitar and vocals. Since emerging with the more explicitly folky surround sounds of the ‘Wolf River’ EP, a more widescreen Denuo sound has developed, plangent, almost post-rock tones that envelop the listener, halfway between Jeff Buckley and M83.","description_cy":"Presenoldeb llawn ddirgel o Ogledd Cymru, yn segur am fisoedd ar y tro yn ôl pob golwg, mae Denuo yn amgylchynu o gwmpas aml-offerynwr Tom Mason, a’i ddawn am leisiau a gitarau tyner ac atgofus. Ers dod i’r amlwg gyda’r synau mwy gwerinol yr EP ‘Wolf River’, mae Denuo wedi datblygu i ffurf fwy llydan, bron gyda thôn ôl-roc sy’n amgylchynu’r gwrandäwr, hanner ffordd rhwng Jeff Buckley a M83.","facebook":"https:\/\/www.facebook.com\/denuomusic\/","soundcloud":"https:\/\/soundcloud.com\/denuo","twitter":"https:\/\/twitter.com\/denuomusic","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Denuo.jpg"},{"id":34,"name":"Devon","description":"Not quite as un-Googleable as Yes, and surely not to be lurking in the internet’s shadows for much longer, Devon Cassells’ home-produced electropop is rapidly turning heads and gathering fans and playlists spots aplenty. As likely to feature crashing guitars as squealing beats, tracks like ‘Weirdo’ or ‘I Don’t Want 2 B UR Friend’ are a riot of irrepressible youthfulness, a blur of colour, attitude and fun that you could also invite home to meet your parents.","description_cy":"Mae bron yn amhosib i chwilio am Devon ar Google (dal yn haws na Yes), ond mae’r cwest yn werth bob eiliad. Mae Devon Cassells yn coginio’i electropop deniadol yn ei stafell wely ag mae’n troi digonnedd o bennau gyda lle ar lawer playlists. Gyda cymysgedd smart o gitars mathredig a curiadau gwichfawr, mae caenuon fel ‘Weirdo’ a ‘I Don’t Want 2 B UR Friend’ yn reiat o anadferadwyedd ieuenctid, mwg o liw ag agwedd. ","facebook":"https:\/\/www.facebook.com\/DevonDevonMusic\/","soundcloud":"https:\/\/soundcloud.com\/devondevonmusic","twitter":"https:\/\/twitter.com\/devontheplace","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Devon.jpg"},{"id":35,"name":"Do Nothing","description":"Already big cheeses in their native Nottingham, Do Nothing songs play with the violence hidden under polite society, sometimes keeping it down, sometimes letting it out. Still only two singles old, both Witness and Handshakes are deceptively mannered takes on brooding rock and roll, half sung, half spoken vocals rolling over guitars always threatening to blaze into noise. Dark, literate, alluring… but you can hide at the back if you want.","description_cy":"Yn barod yn enwau mawr yn eu cynefin – Nottingham, mae caneuon Do Nothing yn chwarae gyda’r trais cudd o dan gymdeithas cwrtais, weithiau yn cadw hi’n dawel, weithiau ar dop eu lleisiau. Gyda dim ond dau sengl i’w henw, mae’r ddau yn adlewyrchu sain roc a rôl, ag alawon wedi’i hanner-gannu, hanner-llafaru ar ben gitarau sy’n bygythio sain anferth, tywyll a hudolus.","facebook":"https:\/\/www.facebook.com\/TheBandDoNothing\/","soundcloud":"https:\/\/soundcloud.com\/thebanddonothing","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Do-Nothing-1.jpg"},{"id":36,"name":"Dry Cleaning","description":"Live footage shows vocalist Florence standing behind a music stand and a sheaf of papers, as if preparing to give a post punk lecture. Spoken word meanderings dominate the London band’s music, oblique tales and non-sequiturs delivered over rock backing that’s taut, moody and fractious. With a delivery style that recalls Kim Gordon, Prolapse’s Linda Steelyard or Life Without Buildings’ Sue Tompkins, it’s a weird magic trick you’ll want to see multiple times.","description_cy":"O weld ffilmiau o’r band yn perfformio’n fyw, mae’r prif leisydd Florence, yn sefyll tu ôl i stondin gerddoriaeth a thaflenni o bapurau arni, fel pe bai’n barod i roi darlith ar gerddoriaeth ôl-bync. Mae llafar ganu Florence yn dominyddu cerddoriaeth y band o Lundain, gyda hanesion a chwedlau yn cael eu hadrodd dros gerddoriaeth roc trwm. Gydag arddull sy’n debyg i Kim Gordon, Linda Steelyard o Porlapse neu Sue Tompkins o Life Without Buildings, mae’n dric hud, sydd angen cael ei weld dro ar ôl tro ar ôl tro. ","facebook":null,"soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Dry-Cleaning-1.jpg"},{"id":37,"name":"Dylan Cartlidge","description":"Seeing Dylan Cartlidge live will answer any questions you have about the well-earned hype that’s been engulfing his presence recently. His April release, an incredibly engaging EP titled ‘Monsters Under The Bed’ sees Cartlidge swim through psychey blues rock, powerful soul and funky hip hop that flows superbly. All the while, making it look so, so easy. ","description_cy":"Neuth gweld Dylan Cartlidge yn fyw ateb unrhyw gwestiynnau sydd gennych chi am y cyffro sy’n ymdrochi ei bresenoldeb at hyn o bryf. Fe rhyddhaodd EP hynod o afaelgar, ‘Monsters Under The Bed’ yn Ebrill a mae’n gweld Cartlidge yn nofio drwy rock blues psychedelic, soul pwerus a trwm a hip hop ffynci sy’n llifo’n rhagorol. Ag mae’n neud i hyn edrych mor mor hawdd.","facebook":"https:\/\/www.facebook.com\/DylanCartlidgeMusic\/","soundcloud":"https:\/\/soundcloud.com\/dylan-cartlidge","twitter":"https:\/\/twitter.com\/DylanCartlidge","website":"http:\/\/www.dylancartlidge.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Dylan-Cartlidge.jpg"},{"id":38,"name":"Eädyth","description":"A bilingual, multi-instrumental, self-producing artist from Merthyr, Eädyth Crawford makes soulful, modern R&B that’s luscious and powerful in equal measures. Recent tracks ‘Shots’ and ‘Break’ show Eädyth’s range: the former a layered, down-tempo groove; the latter a propulsive banger that slaps with moodiness. Both showcase Eädyth’s stacked vocal skills, and hint at more to come from this youthful talent.","description_cy":"Aml-offerynnwr sy’n hunan-gynhyrchu yw Eädyth o Merthyr. Mae Eädyth Crawford yn creu R&B modern llawn enaid a haenau. Mae’r ddau sengl diweddara, Shots a Break yn lordio ystod eang o sgiliau Eädyth, ei llais a’i chynhyrchu gwybodus sy’n gaddo lot mwy i ddod gan y talent ifanc yma.","facebook":"https:\/\/www.facebook.com\/eadythofficial\/","soundcloud":"https:\/\/soundcloud.com\/eadythofficial","twitter":"https:\/\/twitter.com\/eadythofficial","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Eadyth.jpg"},{"id":39,"name":"Easy Life","description":"From Leicester pubs to Coachella deserts, Easy Life’s widescreen R&B has taken them on a rapid flight into orbit. They’ve kept it real though: the rough edges on lead vocalist Murray’s words remain, the tales of life lacking money and love still form the backbone of Easy Life’s music. Listen to their singles: Pockets and Temporary Love Part 1 & 2 both splurge on skittering falsettos, clean keys and brass pokes, mixing innovative electronic sounds with proper band, full earworm tunes. Dangerously addictive boys.","description_cy":"O dafarndai Caerlŷr i anialwch Coachella, mae R&B Easy Life wedi’u harwain ar eu taith gyflym syth mewn i orbit. Er hyn, mae eu traed yn gadarn ar y ddaear: mae llais pigog a garw’r prif leisydd, Murray yn parhau, gyda’i hanesion am brinder arian a chariad yn asgwrn cefn i gerddoriaeth Easy Life. Gwrandewch ar eu senglau: Pockets and Temporary Love Part 1 & 2, mae’r ddwy sengl yn llawn skit falsetto, allweddellau glan a prociadau cryf gan offerynnau pres. Yn cyfuno synau electronig arloesol gyda band go iawn a  tiwns gogoneddus. Mae peryg o fod yn gaeth i’r band hwn.","facebook":"https:\/\/www.facebook.com\/easypeasylemonsqueezylife\/","soundcloud":"https:\/\/soundcloud.com\/easylife-937134923","twitter":"https:\/\/twitter.com\/easylife","website":"http:\/\/www.easylifemusic.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Easy-Life.jpg"},{"id":40,"name":"Egyptian Blue","description":"From humble beginnings above a jewellery shop in Colchester these young (post) punks have coalesced in Brighton where they have sharpened their riffs and simultaneously darkened their lyrical world view. With the aid of producer pal Theo Verney they reflect this murky modern world we live in with an unexpected sense of euphoria and urgency.","description_cy":"Yn creu cerddoriaeth psychedelic, ôl-bync, mae Egyptian Blue yn don enfawr o gitar miniog a melodïau taranllyd. Ar ôl ffurfio mewn siop gemwaith yn Colchester, mae’r pedwarawd bellach yn byw yn Brighton. Mae enw’r band yn deillio o liw a ddiflanodd am gyfnod – glas tywyll iawn, daeth o gyfnod yr Aifft a ddiflannodd tan iddo gael ei ddarganfod unwaith eto yn ystod y cyfnod Romanaidd – ond peidiwch a phoeni, ni fydd Egyptian Blue yn diflannu!","facebook":"https:\/\/www.facebook.com\/egyptianblueinc\/","soundcloud":"https:\/\/soundcloud.com\/egyptianblueinc","twitter":"https:\/\/twitter.com\/egyptianblueinc","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Egyptian-Blue.jpg"},{"id":41,"name":"Elis Derby","description":"Comprehensive wide-boy vibes from this North Walian youngster, whose online presence is full of cheeky guitar numbers. There’s great playfulness to songs like ‘Yn Y Bôn’ or ‘Sut Allai Gadw Ffwrdd’, all Arctic Monkeys jinks or Supergrass vocal hooks, while ‘Prysur Yn Gwneud Dim Byd’ displays a chilled, Mac Demarco take on the world.","description_cy":"Dechreuodd Elis recordio ac uwchlwytho demos i’w broffil Soundcloud yn ystod misoedd cynnar 2018, gan fynd ymlaen i ddechrau perfformio’n fyw ym mis Awst gyda band llawn. Ers hynny mae wedi bod yn gigio’n rheolaidd o gwmpas Cymru, a wedi ffeindio’r amser i ryddhau 3 sengl, gan gynnwys ei ddiweddaraf ‘Yn Y Bôn’, sydd allan nawr ar Recordiau Hufen. Gyda Haf 2019 yn rhagdybio i fod yn un prysur iawn iddo, y bwriad yw mynd i’r stiwdio i ddechrau rhoi sylfaen i albwm\/EP sydd ganddo wedi ei ‘sgwennu yn barod – gyda mwy o fanylion i ddod ar hynny yn fuan!","facebook":"https:\/\/www.facebook.com\/ElisDerbyBand\/","soundcloud":"https:\/\/soundcloud.com\/elis-derbyshire","twitter":"https:\/\/twitter.com\/ElisDerby","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Elis-Derby.jpg"},{"id":42,"name":"Elsa Hewitt","description":"A mesmerising concoction of electronic lo-fi house, future garage and experimental techno, Elsa Hewitt creates a distinctive yet unpredictable sound which evolves with every release. Her 5th album Citrus Paradisi was released in March of this year and has been on constant spin at Swn HQ. ","description_cy":"Cymsgedd syfrdanol o gerddoriaeth house lo-fi electroneg a techno arbrofol, mae Elsa Hewitt yn creu sain anrhagweladwy sy’n esblygu bob tro mae hi’n rhyddhau. Fe rhyddhaodd yr artist ei 5ed album; Citrus Paradisi yn mis Mawrth eleni a ni wedi bod yn chwarae’r casgliad newydd ar stereo y swyddfa ym mhencadlys Sŵn.","facebook":"https:\/\/www.facebook.com\/elsahewittx\/","soundcloud":"https:\/\/soundcloud.com\/elsahewitt","twitter":"https:\/\/twitter.com\/elsahewittx","website":"http:\/\/www.elsahewitt.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Elsa-Hewitt.jpg"},{"id":43,"name":"Emma McGrath","description":"North Londoner Emma McGrath has been releasing music since she was 14, when her EP ‘The Judgement’ caught attention via its combination of pure folk directness and McGrath’s rough, powerful vocals. Subsequent releases have found McGrath working with Grammy winner Jimmy Hogarth (Amy Winehouse, Sia) and broadening her sonic palette to embrace a sweepingly emotive spectrum of sound. Currently in the midst of a triptych of EPs, recent track ‘Other Side’ brings mature pop touches to a simple love song, while still highlighting those strong, Tracey Chapman-esque vocals. All-conquering. ","description_cy":"Cerddoriaeth gwerin, pur ag uniongyrchol sydd yn cael ei gynnig gan Emma McGrath, sy’n bachu gyda llais anferth ag amrwd. Ar ol dilyniant cryf o rhyddhau senglau a mini-album yn 2018, mae McGrath wedi ffeinio’i hun yn gweithio gyda Jimmy Hogarth (Amy Winehouse, Sia) ag yn gweithio gyda paled sonig ehangach. Mae’r sengl diweddar, ‘Other Side’ yn dod a darnau pop aeddfed a can serch syml at eu gilydd, tra’n cadw’r llais cryf a rhyfeddol yna yn flaengar.","facebook":"https:\/\/www.facebook.com\/EmmaMcGrathUK\/","soundcloud":"https:\/\/soundcloud.com\/emmamcgrathuk","twitter":"https:\/\/twitter.com\/EmmaMcGrathUK","website":"https:\/\/www.emmamcgrath.co.uk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Emma-McGrath.jpg"},{"id":44,"name":"False Hope For The Savage","description":"Something of a local supergroup, False Hope For The Savage are based in Cardiff, feature members of Samoans, Cut Ribbons and The Echo And The Always, and have been playing irregularly since forming a couple of years ago. As seen on two self-released EPs so far, moodily naming their songs sequentially with Roman numerals, their music is a gorgeously atmospheric take on post rock, songs languorously layered with effects pedal sheen, building to epic plateaus and crashes. There may be dry ice.","description_cy":"Fel rhyw fath o supergroup lleol, mae False Hope For The Savage sydd wedi’i seilio yng Nghaerdydd, yn cynnwys aelodau o Samoans, Cut Ribbons a The Echo And The Always, ac wedi bod yn chwarae yn afreolaidd ers ffurfio cwpl o flynyddoedd yn ôl. Maent yn creu sain post-rock, atmosfferig sy’n adeiladu mewn ffordd epig i’r clustiau. Disgwyliwch fwg dramatig ar lwyfan yn ystod y perfformiad prin gan y bwystfilod swnllyd yma.","facebook":"https:\/\/www.facebook.com\/fhfts\/","soundcloud":"https:\/\/soundcloud.com\/fhfts","twitter":"https:\/\/twitter.com\/FHFTSband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/False-Hope-for-the-Savage.jpg"},{"id":45,"name":"Far Caspian","description":"Dreamy Leeds based (with roots in Liverpool and Ireland) indie-poppers with a wistful and hazy but highly melodic edge. Despite lyrical themes of depression, dislocation and deep mid Winter blues their musical outlook is far brighter and breezier than you might imagine, all shimmering guitar lines punctuated by emphatic gang vocals.","description_cy":"Adeiladwyd cynsail lo-fi Far Caspian yn neuadd prifysgol y cynhyrchydd a’r prif leisydd, Joel Johnston cyn ymunodd Jof Cabeda (drymiau a llais) ac Alessia Scozarro (bass a llais). Ers denu sylw blogs yn fuan yn ystod eu gyrfa, mae’r band pop-breuddwydiol wedi eu henwi fel “One of the North’s best emerging indie bands of the year” gan The Line of Best Fit, gyda’r cynulleidfaoedd byw yn ymateb yn bositif tu hwnt i’w taith cyntaf wrth i nifer o’u perfformiadau werthu pob un tocyn.  Gyda’u tracs o’u EP cyntaf ‘Between Days’ a’u senglau breuddwydiol pop ‘A Dream of You’ a ‘Conversations’ yn derbyn cefnogaeth gan Radio 1, 6 Music a Radio X a chael eu caneuon wedi’u ffrydio miliynnau o weithiau ar Spotify a Youtube, mae Far Caspian yn parhau i greu stwr gyda’u tiwns aeddfed, llyfn ac unigryw.","facebook":"https:\/\/www.facebook.com\/FarCaspian\/","soundcloud":"https:\/\/soundcloud.com\/far-caspian","twitter":"https:\/\/twitter.com\/FarCaspian","website":"http:\/\/www.farcaspian.org","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Far-Caspian.jpg"},{"id":46,"name":"Fatherson","description":"Forming in Kilmarnock some years ago now, Fatherson fit beautifully into that lineage of Scottish bands, like Twilight Sad or Frightened Rabbit, whose Caledonian brogue and slow-burning music packs devastating emotional punches. Currently on album number three, Fatherson are still creating powerful indie rock music, music that swells and crashes with an intensity that speaks of more than just a three-piece band. Friends since childhood, they seem unstoppable, so let them in.","description_cy":"Dringodd y band yma i’r ucheldiroedd yn seiliedig ar bobl yn siarad â’i gilydd, dim schort-cuts, jest pobl yn dwlu ac yn rhannu eu cerddoriaeth. Petai chi’n mynychu unrhyw gig Fatherson, byddwch chi’n siŵr o fod mewn ‘stafell llawn dop o ffans yn canu pob un gair o’u caneuon roc llawn angerdd. Yn wreiddiol o Kilmarnock, yr Alban,  mae’r tri ffrind ysgol wedi bod yn perfformio mewn lleoliadau sy’n dal 600 o bobl, ac yn gwerthu pob un tocyn – yn hawdd – ac hynny cyn iddynt ryddhau eu dwy albym cyntaf ‘I Am An Island’ (2014) ac ‘Open Book’ (2016).","facebook":"https:\/\/www.facebook.com\/fathersonband\/","soundcloud":"https:\/\/soundcloud.com\/fathersonband","twitter":"https:\/\/twitter.com\/fathersonband","website":"http:\/\/www.fathersonband.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Fatherson.jpg"},{"id":47,"name":"Feet","description":"A many-headed beast from Coventry, Feet are part of the fine tradition of slightly eccentric British psychedelia gangs. You might hear bits of the Beatles, the Coral or Syd Barrett here, but Feet are no retro merchants, rather a warped ideas factory, swerving between sounds and genres, all with a goofy smile on their faces. Having recently come under the wing of Yala! Records, Felix White from the Maccabees label and club night, festivals seem the ideal place for Feet action, so frug to the front here.","description_cy":"Yn fwystfil o Coventry, mae Feet yn rhan o linach o gangiau seicadeilic Prydain. Efallai y byddwch chi’n clywed darnau o’r Beatles, the Coral neu Syd Barrett yma, ond nid yw Feet yn fasnachwyr retro, yn hytrach yn ffatri o syniadau gwallgof, yn llifo rhwng synau a genres cerddorol, ac yn gwneud hyn i gyd yn wên o glust i glust. Ers dod yn rhan o deulu Yala! Records, mae Felix White o label y Maccabees yn honni mai’r lle gorau i weld Feet yw mewn clwb nos neu mewn gŵyl gerddorol, felly cer i sefyll yn y blaen! ","facebook":"https:\/\/www.facebook.com\/FEETbandUK\/","soundcloud":"https:\/\/soundcloud.com\/feetband","twitter":"https:\/\/twitter.com\/feetband","website":"https:\/\/www.feetband.co.uk\/?fbclid=IwAR0lFKpNEPh9uDFa8Lm3DHEPy_Sq3eVukzmT2ZbxaVLXdn4_JLDH6JdNeO0","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Feet.jpg"},{"id":48,"name":"Flamingods","description":"A virus sent around the world to infect all dancefloors, Flamingods are a band impossible not to groove to, music that mashes together psychedelia, rock, prog, African and Middle Eastern sounds and a whole load more into massive rhythmic shapes. With their roots both in Bahrain and Britain, Flamingods have been releasing records since 2012 (including an album for local legends Shape), finding an appropriate home with globetrotters Soundway Records, before hopping on to Moshi Moshi for latest album Levitate, all the while sending out their itchy, addictive and relentless music to the rest of the planet.","description_cy":"Yn bla sydd wedi’i ladaenu o gwmpas pob llawr ddawnsio, mae Flamingods yn fand sy’n eich gorfodi i ddawnsio a grŵfio. Cerddoriaeth sy’n gyfuniad o seicadeilia, roc, prog, synau Affricanaidd a Dwyrain Canol gyda llwyth mwy o rhythmau a symudiadau enfawr, amrywiol. Gyda’u gwreiddiau ym Bahrain a Phrydain, mae Flamingods wedi bod yn rhyddhau albymau ers 2012 (gan gynnwys albym ar gwmni recordiau lleol, chwedlonol, Shape), cyn dod o hyd i gartref addas gyda Soundway Records, yna’n symud ymlaen at Moshi Moshi i ryddhau eu halbwm diweddaraf Levitate, ac yn y cyfamser yn parhau i rannu eu cerddoriaeth coslyd, caethiwus a di-baid i weddill y byd.","facebook":"https:\/\/www.facebook.com\/flamingodsmusic\/","soundcloud":"https:\/\/soundcloud.com\/flamingodsmusic","twitter":"https:\/\/twitter.com\/Flamingods","website":"https:\/\/www.flamingods.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Flamingods.jpg"},{"id":49,"name":"Foxxglove","description":"Foxxglove is Cardiff-based artist, Ffion Murray’s project that blends stunningly moody pop with dark electronics, using her own experiences as the base of her songwriting. Foxxglove delivers her story with raw honesty and openness that recalls artists like Daughter or Novo Amor. 2019 has seen her debut her live shows, join Forté Project’s list of 10 acts, working with artist & producer Minas and will be releasing her single City in the autumn. We can’t wait to be a part of her exciting year! ","description_cy":"Mae Foxxglove yn gerddor o Gaerdydd, mae prosiect Ffion Murray yn plethu pop dwys, difridol gyda electronics tywyll yn defnyddio ei phrofiadau ei hun wrth fynd ati i ysgrifennu caneuon. Mae Foxxglove yn cynnig stori sy’n amrwd, onest ac agored sy\\’n debyg i artistiaid eraill fel Daughter a Novo Amor. Perfformiodd mewn sawl gig byw yn ystod 2019, ymunodd â’r Forte Project a gweithiodd fel cerddor a chynhyrchydd i Minas. Bydd Foxxglove yn rhyddhau ei sengl ‘City’ yr Hydref hwn ac rydyn ni wedi’n dotio i fod yn rhan o’i blwyddyn cyffrous hi!","facebook":"https:\/\/www.facebook.com\/Foxxgloveuk\/","soundcloud":"https:\/\/soundcloud.com\/user-134252719","twitter":"https:\/\/twitter.com\/foxxgloveuk","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Foxxglove.jpg"},{"id":50,"name":"Francis Lung","description":"Ex WU LYFer turned solo artist. Hailing from Manchester, the shadow of the melodic side of that city’s musical heritage looms large but doesn’t ever obscure his singular vision, encompassing influences stretching from Chilton to Cobain, and much in between. This year’s debut full length ‘A Dream Is U’ on Memphis Industries showcases his versatility perfectly.","description_cy":"Mae Francis Lung yn ganwr\/cyfansoddwr a chynhyrchydd â’r ddawn i chwarae sawl offeryn, o Fanceinion. Dechreuodd ysgrifennu a chasglu cerddoriaeth ar ôl dirywiad ei fand blaenorol WU LYF yn 2012. Rhyddhaodd ei EP cyntaf ‘Vol 1’ ar ei label ei hun ‘Songs Records’ ac yn 2015 disgrifiodd The Line Of Best Fit yr EP fel “antholeg o gyfansoddiadau meistrolgar, clasurol a thyner”. Canmoliwyd ei EP nesaf ‘Vol ||’ fel “melodïau hamddenol, meddylgar a threfniadau cymhleth sy’n gwegian mewn atmosffer ôl-bync”.","facebook":"https:\/\/www.facebook.com\/francislungofficial\/","soundcloud":"https:\/\/soundcloud.com\/francislung","twitter":"https:\/\/twitter.com\/FrancisLung","website":"https:\/\/www.francislung.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Francis-Lung.jpg"},{"id":51,"name":"Free Love","description":"Building a bigger utopia out of the mini-utopia that is Glasgow’s creative scene, Free Love may have changed their name from Happy Meals, but their mission remains the unchanged: achieving communal bliss through delirious music that takes in analogue acid, psychedelic krautrock and Italo dream disco. The duo of Suzi Rodden and Lewis Cook have held yoga afternoons and all night sleep events, but it’s their gigs that smack you in the face, with Rodden’s English and French-sung, feral dervish performances like a touchpaper to you soul. Man. Do not miss.","description_cy":"Yn creu iwtopia allan o iwtopia llai sef sîn greadigol Glasgow, er bod Happy Meals wedi newid eu henw i Free Love, maent yn bwriadu gwneud union yr un peth – creu bliss cymunedol rhwng cerddoriaeth gorffwysol gyda asid analog, krautrock seicadelic a breuddwyd disco Italo. Mae Suzi Rodden a Lewis Cook wedi cynnal gwersi yoga yn y p’nawn a nosweithiau cysgu ond mae eu gigs yn llwyddo i’ch deffro gyda geiriau Ffrengig a Saesneg Rodden a pherfformiadau bydd yn cyffwrdd â’ch henaid. Peidiwch a methu hwn.","facebook":"https:\/\/www.facebook.com\/fr33l0v3\/","soundcloud":"https:\/\/soundcloud.com\/freelovenrg","twitter":"https:\/\/twitter.com\/freelove_nrg","website":"http:\/\/freelovenrg.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Free-Love.jpg"},{"id":52,"name":"Gaffa Tape Sandy","description":"Day-glo, sugar rush, excitable, shouty, indie-garage-rock-pop-punk par-excellence. You probably won’t be surprised that they’ve found a home from home with the equally giddy Alcopop! Records. Make sure you queue up nice and early to get down the front to shout along with them. Life affirming stuff.","description_cy":"Ffurfiodd Gaffa Tape Sandy o ganlyniad i awch tri ffrind i wneud sŵn mawr a chyffrous. Tyfodd poblogrwydd y band yn gyflym ar ôl perfformio eu tiwns haentus, garej-pync\/roc mewn sawl sioe byw. Mae ei EP cyntaf ‘Spring Killing’ wedi sicrhau eu bod yn perfformio yn Glastonbury eleni a’u sengl cyntaf ‘Beehive’ wedi derbyn cefnogaeth gan Huw Stephens ar ‘Tip of the Week’ ar Radio 1.","facebook":"https:\/\/www.facebook.com\/gaffatapesandy\/","soundcloud":"https:\/\/soundcloud.com\/gaffatapesandy","twitter":"https:\/\/twitter.com\/gaffatapesandy","website":"https:\/\/linktr.ee\/gaffatapesandy","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Gaffa-Tape-Sandy.jpg"},{"id":53,"name":"Ghostlawns","description":"Ghostlawns are a Cardiff-based musical collective comprised of Andrew ‘Bernie’ Plain (Right Hand Left Hand), Gid Goundrey (Gulp), Dewi Parry and Jonny Brooks-Jones (various). Their eclectic blend of instrumentation brings to life a massive, atmospheric creature of electronica. Soon to have a full album to show off, for now the four piece give a showcase to the inner workings of their minds just for us.","description_cy":"Casgliad o gerddorion o Gaerdydd yw Ghostlawns, gan gynnwys ‘Bernie’ Plain (Right Hand Left Hand), Gid Goundrey (Gulp), Dewi Parry a Jonny Brooks-Jones (amryw). Mae eu cymysg o sain offerynnol yn adfywio creadur o ddyfnderau electronica atmosfferig. Gydag albwm llawn i ddod yn fuan, mae’r pedwarawd am arddangos canlyniadau eu syniadau mewnol i ni!","facebook":null,"soundcloud":"https:\/\/soundcloud.com\/ghostlawns","twitter":"https:\/\/twitter.com\/ghostlawnsCF","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Ghostlawns.jpg"},{"id":54,"name":"Grace Lightman","description":"Fifty years since Neil Armstrong and co signally failed to bring back any extraterrestrials lifeforms, Grace Lightman is here to inject not just some alien vibes, but some highly luxurious French disco space rock alien vibes. ‘Silver Eater’ is the debut LP the Londoner Lightman has just released, and it’s a DIY concept album about a marooned alien navigating the weird Earth life of humans. That these musings are wrapped in gloriously bubbling technicolour krautpop that Goldfrapp, Air or Add N To (X) would be proud of is a definite bonus. This weekend’s decadent, indulgent treat.","description_cy":"Pumdeg mlynedd ers i Neil Amstrong & co fethu dod a unrhyw fath o estroniaid nôl i’r ddaear, mae Grace Lightman yma i wystrellu vibes estroniaid mewn i’n bywydau, ond nid vibes estroniaid cyffredin mohonynt, ond vibes estroniaid Ffrenging, disgo a roc arallfydol. Mae ei LP cyntaf ‘Silver Eater’ yn albym DIY am estron sy’n trio deall defodau rhyfedd bodau dynol ar y ddaear. Mae’r caneuon yma wedi eu gorchuddio yn ofalus gan krautpop o bob lliw y byddau Goldfrapp, Air neu Add N To (X) yn falch o weld. Dyma’ch pwdin i’r penwythnos. ","facebook":"https:\/\/www.facebook.com\/gracelightman\/","soundcloud":"https:\/\/soundcloud.com\/grace-lightman","twitter":"https:\/\/twitter.com\/GraceLightman","website":"http:\/\/www.gracelightman.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Grace-Lightman.jpg"},{"id":55,"name":"Gruff Rhys","description":"Corner any gaggle of drinkers in any pub in Wales, ask them for their favourite Gruff Rhys moments, and try and keep up. Is it the Super Furry Animals years, or before them in Ffa Coffi Pawb or after in Neon Neon? The Incredible, Insatiable Candylion stage play? How about the documentary travelogues, Separado! and American Interior? Clearing half of Clwb via his collaboration with Brazilian VCR repairman Tony Da Gatorra? Crunching carrots for Misty’s Big Adventure? Or simply being an unending source of inspiration, an artist not just responsible for continued excellent solo and collaborative music but also the urge to do more, in all directions, in whatever interesting ways possible? Probably that last one, and the hair.","description_cy":"Eistedda i lawr gyda rhywun yng Nghymru mewn tafarn, a gofynna iddyn nhw beth yw ei hoff adeg Gruff Rhys, a phob lwc i ti wrth i ti drio dilyn y sgwrs. Ai blynyddoedd y Super Furry Animals, neu cyn hynny yn Ffa Coffi Pawb neu ar ôl yn Neon Neon? Ai perfformiad llwyfan The Incredible, Instatiable Candylion? Neu beth am y ddogfen deithiol Seperado! a America Interior? Yn llenwi Clwb wrth iddo berfformio ar y cyd gyda’r gŵr o Brasil Tony Da Gatorra? Yn crensian ar foronen yn Misty’s Big Adventure? Neu yn syml iawn, bod yn ysbrydoliaeth ddiddiwedd a cherddor sydd nid yn unig yn creu gwaith unigol a grŵp anhygoel, ond sydd â’r gallu a’r awch i wneud mwy, mewn sawl cyfeiriad, yn y ffordd fwyaf diddorol erioed? Yr un olaf siŵr o fod, neu’r gwallt.","facebook":"https:\/\/www.facebook.com\/Gruffingtonpost\/","soundcloud":"https:\/\/soundcloud.com\/gruffrhys","twitter":"https:\/\/twitter.com\/gruffingtonpost","website":"http:\/\/gruffrhys.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Gruff-Rhys.jpg"},{"id":56,"name":"Gwilym","description":"The ‘Best Band of 2018’ according to the readers of Selar – Gwilym are going from strength to strength following their success at Selar Awards back in February, where they won 5 awards. Their catchy indie-pop songs never fail to get the crowd dancing!","description_cy":"Band Gorau 2018’ yn ôl darllenwyr y Selar – mae Gwilym yn mynd o nerth i nerth yn dilyn eu llwyddiant yng Ngwobrau’r Selar ym mis Chwefror lle ennillon nhw bum gwobr. Tydy eu caneuon indi pop bachog byth yn methu â chael y dorf i ddawnsio! ","facebook":"https:\/\/www.facebook.com\/GwilymBand\/","soundcloud":"https:\/\/soundcloud.com\/user-236548664","twitter":"https:\/\/twitter.com\/_gwilym","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Gwilym.jpg"},{"id":57,"name":"Haze","description":"Bringing the bovver boy rock to Bristol and beyond for a year or two now, Haze’s lurching garage racket is thick with dense allusions to history and politics (previous subjects include deification of flawed historical figures and Trotsky’s time in Mexico), while maintaining a queasy malevolence and swagger. Now on Hate Hate Hate Records, previously home to Fat White Family and the Wytches, prospects for conquering Britain, one Spoons at a time, look good.","description_cy":"Yn dilyn blynyddoedd o ddiflastod mewn pentref bach yn yml Buckinghamshire, mae Haze erbyn hyn yn byw ym Mryste ac yn creu cerddoriaeth cadarn, cryf a brysiog. Mae eu sengl diweddaraf ‘St John’ yn drwm â llinell fas cryf yn rhedeg drwyddo gyda’r geiriau wedi’u hysbrydoli gan amser Trotsky yn Mexico gyda Frida Kahlo. ","facebook":"https:\/\/www.facebook.com\/haze97\/","soundcloud":"https:\/\/soundcloud.com\/hazeband97","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Haze.jpg"},{"id":58,"name":"Heavy Lungs","description":"Rising from the swamp of Bristol’s high-volume bands a couple of years ago, debut single Poster Boy, with its strained dynamics and almost rockabilly guitars, showed a band far from merely punk or rock and roll. The band play with space and post punk timing, while vocalist Danny Nedelko (yes yes, subject of that Idles song) has a blank roar in the vein of great European art punks like Iceage. Bang your head to all of it.","description_cy":"Yn codi o gors y nifer o fandiau o Bryste cwpl o flynyddoedd yn ôl, mae sengl cyntaf y band, Poster Boy yn diwn deinameg dan straen gyda llinellau gitars sy’n agos at rockabilly, sy’n cyflwyno band yn bell i ffwrdd o gydymffurfio a pync neu roc a rôl yn unig. Maent yn chwarae gydag amseru post-punk, tra bod y canwr Danny Nedelko (ie, ie, testun Y gân Idles yna) yn rhuo i’r cynulleidfaoedd.","facebook":"https:\/\/www.facebook.com\/heavylungsband\/","soundcloud":"https:\/\/soundcloud.com\/heavylungsband","twitter":"https:\/\/twitter.com\/Heavylungsband","website":"https:\/\/www.balleyrecords.com\/artist\/heavy-lungs?fbclid=IwAR2BuUVe54qTjwVMbDv6Vkhe6ScJf1OYem3M4EXHJthDb0-XdgBQwBf50QE","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Heavy-Lungs.jpg"},{"id":59,"name":"Himalayas","description":"Himalayas are an indie rock garage band from Cardiff consisting of  James Goulourn (drums), Mike Griffiths (guitar and vocals) Lois Heaps (bass) and Joe Williams (guitar and vocals). The band create a cinematic sound in a dreamy style. Their thick guitars, ","description_cy":"Band indi garej roc o Gaerdydd yw Himalayas gyda James Goulourn (drymiau), Mike Griffiths (gitar a llais), Lois Heaps (bass) a Joe Williams (gitar a llais). Mae’r band yn creu sŵn sinematig a steil sy’n sicr o adael y gynulleidfa mewn breuddwyd. Mae ei gitars trwm, lleisiau gwych a’u halawon anthemig yn sicr o lwyddo i ddenu sylw pawb. ","facebook":"https:\/\/www.facebook.com\/HimalayasBand\/","soundcloud":"https:\/\/soundcloud.com\/user-83036502","twitter":"https:\/\/twitter.com\/Himalayas_band","website":"http:\/\/www.himalayasband.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Himalayas.jpg"},{"id":60,"name":"HMLTD","description":"Forged together by some of South Wales’ best known and best loved musicians in the DIY punk scene. Honest Thieves are a trio built of members of bands like Pipedream and Dividers. Their origin is clear when you listen to their music, their debut EP “Ineptitude” still has a footprint of those old bands, but now strengthened with their hard gruff hardcore exterior. ","description_cy":"Does dim byd diflas am y band yma o Lundain. Mae HMLTD yn gelf byw gyda glam rock electroneg afreolus yn toddi’n berffaith gyda gwisgoedd, props a’u ffordd o fyw i greu un anghenfil di-dor. Mae caneuon fel ‘Stained’ a ‘To The Door’ yn llosgi’n llachar fel gwibfaen, fel Bowie ag Adam Ant yn llosgi clwb nos danddaearol. Does dim dianc.","facebook":"https:\/\/www.facebook.com\/HMLTD\/","soundcloud":"https:\/\/soundcloud.com\/happy-meal-ltd","twitter":"https:\/\/twitter.com\/HMLTD","website":"http:\/\/www.hmltd.org\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/HMLTD-1.jpg"},{"id":61,"name":"Holy Fuck","description":"Our not so secret set…Holy Fuck are a legendary live electronica quartet from Canada. With their 5th album release on its way the band’s high energy live shows put you in a “do I bop or headbang” limbo land. We suggest you do both! ","description_cy":"","facebook":"https:\/\/www.facebook.com\/holyf\/","soundcloud":"https:\/\/soundcloud.com\/holyfuck","twitter":"https:\/\/twitter.com\/holyfuck","website":"https:\/\/www.holyfuckmusic.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Holy-Fuck.jpg"},{"id":62,"name":"Honest Thieves","description":"Forged together by some of South Wales’ best known and best loved musicians in the DIY punk scene. Honest Thieves are a trio built of members of bands like Pipedream and Dividers. Their origin is clear when you listen to their music, their debut EP “Ineptitude” still has a footprint of those old bands, but now strengthened with their hard gruff hardcore exterior. ","description_cy":"Ein set ‘cyfrinachol’…Mae Holy Fuck yn fand electronica swnllyd o Ganada sydd wedi gwneud enw i’w hunain. Gyda’u pumed album ar y ffordd, mae’u set bywiog yn neud i chi gwestiynnu “ydw i’n bopio neu headbangio i hwn?” – ni’n awgrymu neud y ddau!","facebook":"https:\/\/www.facebook.com\/honestthievesband\/","soundcloud":"https:\/\/soundcloud.com\/honestthievesband","twitter":"https:\/\/twitter.com\/honestthievesuk","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Honest-Thieves.jpg"},{"id":63,"name":"Hotel Lux","description":"From the same rowdy South London scene as Shame and Goat Girl, Hotel Lux are the grubby documentarians of the area, turning their lens on boozer life and violent reprobates via pubby, arty guitar rock. At their lighter end, something like The English Disease recalls a lairy Half Man Half Biscuit, but the dark heart of Hotel Lux are songs like Daddy and The Last Hangman, bruising excavations of society that build from simple sounds to dense rackets of noise and shouting.","description_cy":"O’r un lle swnllyd yn Ne Llundain y mae Shame a Goat Girl yn dod, Hotel Lux yw’r bobl sy’n dogfennu’r ardal yma i’r dim, yn esbonio eu bywydau boozy trwy roc gitar greadigol. Ar ochr fwy ysgafn y band y mae caneuon fel The English Disease a Half Man Half Biscuit, ond yna ar ochr dywyll y band cawn Daddy a The Last Hangman. Sŵn trwm, dwys sy’n sicr o gleisio’ch clustiau.","facebook":"https:\/\/www.facebook.com\/hotelluxband\/","soundcloud":"https:\/\/soundcloud.com\/hotelluxband","twitter":"https:\/\/twitter.com\/hotelluxband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Hotel-Lux.jpg"},{"id":64,"name":"Housewives","description":"Atonal post punk you can dance to, kind of, Housewives are half junkshop robots, half sleek guitar technicians, and all about a relentless, rhythmic, twitchy racket. A lot of weird noises have gone into their many releases, for Faux Discx, Rocket Recordings and Blank Editions: you may hear high-pitched keyboard pips, homemade instruments, squeaked-up vocals or, on latest single SmttnKttns, a kind of mutant sax disco no-one in their right mind could cop off to. It’s cult time.","description_cy":"Cerddoriaeth ôl-bync y gallwch chi ddawnsio iddo, fi’n credu, mae Housewives yn hanner robots, hanner technegwyr gitar, ac maent i gyd yn creu sŵn dirdynnol, rhythmig a gwych. Clywn sawl sŵn rhyfedd yn eu cerddoriaeth diweddaraf; sŵn allweddellau uchel gyda lleisiau gwychlyd  y cewch chi yn Faux Discx, Rocket Recordings a Blank Editions. Yna yn ei sengl diweddaraf, SmttnKttns mae presennoldeb sacsoffon a vibes disgo yn amlwg trwy’r gân.","facebook":"https:\/\/www.facebook.com\/HOUSEWIVESBAND\/","soundcloud":"https:\/\/soundcloud.com\/housewivesband","twitter":"https:\/\/twitter.com\/_HOUSEWIVES_","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Housewives.jpg"},{"id":65,"name":"Howl & The Hum (THE)","description":"Having slowly built their reputation with gigs that reach an almost Future Islands-level of intensity, York band The Howl And The Hum are crossing thresholds to larger festivals and anticipated releases. Their music is a literate and dark take on art rock, not afraid to add an electronic pulse or swooping falsetto. If you’re a fanatic, rather than a fan, of Editors, Twilight Sad or Frightened Rabbit, you’re probably queuing up already.","description_cy":"Wrth i rai o’u gigs gyrraedd bron iawn yr un lefel o ddwysedd â gigs Future Islans, mae’r band o Efrog The Howl and The Hum yn croesi draw i wyliau mwy ac yn bwriadu rhyddhau gwaith hir disgwyliedig. Yma gwelwn eu fersiwn tywyll hwy o gelf roc, heb ofni ychwanegu pwls electronig na ffalsetto syfrdanol. Os wyt ti’n ffanatig, yn hytrach na ffan o’r Editors, Twilight Sad neu Frightened Rabbit, dylse ti fod yn ciwio nawr.","facebook":"https:\/\/www.facebook.com\/TheHowlandTheHum\/","soundcloud":"https:\/\/soundcloud.com\/thehowlandthehum","twitter":"https:\/\/twitter.com\/HowlandHum","website":"https:\/\/www.thehowlandthehum.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/The-Howl-and-the-Hum.jpg"},{"id":66,"name":"Hyll","description":"Their name translates as ‘ugly’, they have an ugly-looking face as their profile picture, and their music is… a spirited and youthful take on indie rock. A Cardiff treat for a few years now, Hyll still remain an energetic, scrappy bunch, their rattling racket best enjoyed on recent EP ‘Rhamant’, where the clatter of early Pavement meets the heavy goofiness of Mac DeMarco or Dinosaur Jr, for maximum fun times.","description_cy":"Er bod eu llun proffil yr un mor hyll a’u henw, mae’r gerddoriaeth Hyll yn…  ifanc, chwareus a gwych. Yn un o ddanteithion Caerdydd ers rhaid blynyddoedd, mae Hyll dal i fod yn gang o fechgyn sy’n creu cerddoriaeth indi-roc, clywir yr agwedd tafod yn y boch yma yn glir yn eu EP diweddaraf ‘Rhamant’. Sŵn sy’n debyg i Pavement ond sydd â’r un ffoelineb â Mac DeMarco neu Dinosaur Jr. ","facebook":"https:\/\/www.facebook.com\/hyllband\/","soundcloud":"https:\/\/soundcloud.com\/user-153099522","twitter":"https:\/\/twitter.com\/Hyllband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Hyll.jpg"},{"id":67,"name":"Indian Queens","description":"Like a dream unfolding in slow motion, the songs of Indian Queens have a languid, mesmeric quality. Formed in Hackney Wick, London, by guitarist sisters Jennifer and Katherine O’Neil, plus old friend Mat on drums, it makes perfect sense for the band’s music to be affiliated with Bella Union, the label set up by the Cocteau Twins’ Simon Raymonde. Now on the Cool Thing label, newer songs like You Came Over Late show the band hitting a fine stride of dark shoegaze pop, all loose vocals, slow tempos and lush washes of sound.","description_cy":"Fel breuddwyd sy’n datblygu’n ara’ deg, mae caneuon Indian Queens yn fesmeraidd, llyfn ac yn gwbwl hyfryd. Wedi’u sefydlu yn Hacni Wick, Llundain, mae’r chwiorydd Jennifer a Katherine O’Neil (gitar) a’i hen ffrind Mat (drymiau) yn gysylltiedig â Bella Union, label cafodd ei sefydlu gan Simon Raymonde, Cacteau Twins. Erbyn heddiw, mae Indian Queens ar y label Cool Things, ac wedi rhyddhau caneuon newydd fel You Came Over Late, cân sy’n arddangos gallu arbennig y band o greu shoegaze pop, tempos diddorol a sŵn hollol hyfryd ac unigryw.","facebook":"https:\/\/www.facebook.com\/indianqueens\/","soundcloud":"https:\/\/soundcloud.com\/indian_queens","twitter":"https:\/\/twitter.com\/indianqueens_","website":"https:\/\/www.indian-queens.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Indian-Queens.jpg"},{"id":68,"name":"Jack Perrett","description":"Newport’s premier representative on earth, Jack Perrett combines universal rock and roll behaviour with constantly repping his South Wales origins (he famously went semi-viral with his Parklife pastiche and paean to the city, Portlife). Jack Perrett songs are pure scally good times, a Liam Gallagher-esque attitude and massive earworm tunes. Occasionally lumbered with the Britpop tag, this is more like the irrepressible spirit of street level rock, from The Jam to Oasis to Jake Bugg, in a cracking tracksuit.","description_cy":"Cynrychiolwr blaengar Casnewydd, mae Jack Perrett yn uno ymddygiad roc a rôl byd-eang tra’n cynrychioli ei wreiddiau De Cymru (bron iddo fynd yn viral gyda’i pastiche Parklife, Portlife). Mae ei ganeuon yn bur o amser da mewn steil Liam Gallagher a thiwns enfawr. ","facebook":"https:\/\/www.facebook.com\/JackPerrettMusic\/","soundcloud":"https:\/\/soundcloud.com\/jackperrettmusic","twitter":"https:\/\/twitter.com\/JPerrettMusic","website":"http:\/\/jackperrettmusic.co.uk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Jack-Perrett.jpg"},{"id":69,"name":"Jerskin Fendrix","description":"An alien, from Birmingham, who writes operas in his spare time. The electronic misfit in the Brixton Windmill scene centred around Black Midi, Jerskin Fendrix releases songs rarely, taking the time to craft weirdo futurist pop that’s maddening, disturbing and addictive in equal measures. Songs like ‘Swamp’ or ‘Onigiri’ are soups of distorted vocals, swerving time signatures and sudden bursts of noise, Fendrix riding these beasts like Arca on fiendish poppers. Catch him in a net and don’t let him leave.","description_cy":"Mae Jerskin Fendrix yn ganwr a chynhyrchydd avant-pop o Sir Amwythig. O ganlyniad i’w berfformiadau byw dramatig mae Fendrix wedi cefnogi amryw o artistiaid o GFOTY i Hanna Diamond, Japanese Breakfast a Black Midi.","facebook":"https:\/\/www.facebook.com\/jerskinfendrix\/","soundcloud":"https:\/\/soundcloud.com\/user-292224771","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Jerskin-Fendrix.jpg"},{"id":70,"name":"Jockstrap ","description":"Completely unmissable electronic weirdos from London here, as likely to give you crystalised snares or a 21-piece orchestral suite. Formed at the Guildhall School Of Music and Drama, former home of Mica Levi, Tirzah and more, Jockstrap is Georgia Ellery and Taylor Skye, creating soundscapes that sound like ‘50s Hollywood string sections one minute, Bjork-style avant garde torch songs the next, the PC Music or Arca-grade electronic minimalism straight after. Dark, sensuous, and totally unpredictable.","description_cy":"Mae’n rhaid i chi weld y weirdos electronig yma o Lundain. Ar ôl cwrdd yn Guildhall School Of Music and Drama, mae Georgia Ellery a Taylor Skye yn creu sŵn sy’n swnio weithiau fel soundscape llinynnau o’r 50au, yna fel caneuon avant garde Bjork-aidd yna fel tiwns electronig minimalistaidd. Yn dywyll, synhwyrol ac yn gwbl annisgwyl. ","facebook":"https:\/\/www.facebook.com\/jockstrapmusic\/","soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Jockstrap.jpg"},{"id":71,"name":"John Mouse","description":"5 albums and a gazillion shows in and John MOuse is showing no signs of slowing down, let alone stopping. His live shows are nothing but entertaining. There isn’t a piece of furniture in a Cardiff venue that John MOuse hasn’t climbed upon. Constantly collaborating with others means John MOuse cannot (and assuming, will not) be put in a box – melding influences and hopping genres, the two consistent things in John MOuse’s output is entertainment and cracking song-writing. Join the party.","description_cy":"Ar ôl 5 album a baziliwn o sioeau ers dechrau yn 2006, dyw John MOuse ddim yn dangos unrhyw arwyddion o arafu lawr. Mae ei sioeau byw yn hollol adloniadol a difyr. Does dim un darn o ddodrefn mewn gigfan yng Nghaerdydd dyw John MOuse heb ddringo. Yn gyson yn cydweithio gyda artistiaid eraill, mae John MOuse yn amhosib i gategoreiddio – yn toddi’i ddylanwadau.","facebook":"https:\/\/www.facebook.com\/JohnMOuseMusic\/","soundcloud":"https:\/\/soundcloud.com\/johnmouse","twitter":"https:\/\/twitter.com\/JohnMouseMusic","website":"https:\/\/www.kmiyh.co.uk\/?fbclid=IwAR0f9rRgKmDQtk6zGaEPV1E7SY4PlnxXOzu9-SRqsq0bqym7NKTh1iErkpQ","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/John-Mouse.jpg"},{"id":72,"name":"Josiah Konder","description":"It’s clear that Denmark as a country has something in the water that’s growing some genius musicians rife with character and a particular grim moodyness. They released their debut album Songs For The Stunned last year, shortly before heading off on an incredible tour with Denmarks post punk pioneers, Iceage. With a second album just about to drop on Third Coming Records, we’re poised to receive them and experience their unique potion of  dark post punk and gothic folk music one again.","description_cy":"Mae’n glir fod gan Denmarc rhywbeth yn y dŵr sy’n tyfu athrylithoedd rhemp ar oriog. Fe ryddhawyd y band eu album cyntaf, Songs For The Stunned llynedd ac mae’r ail album ar y ffordd yn barod! Ni’n barod i groesawu’u moddion unigryw o post-punk tywyll a cherddoriaeth gwerin gothig. ","facebook":"https:\/\/www.facebook.com\/josiahkonder\/","soundcloud":"https:\/\/soundcloud.com\/josiahkonder","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Josiah-Konder.jpg"},{"id":73,"name":"Just Mustard","description":"Irish 5 piece who brew up a heady blend of lively atmospheric noise scree and downbeat electronics, seasoned with delicate shoegazey male\/female vocal interplay. Their RTÉ Choice Music Prize shortlisted 2018 debut album “Wednesday” received deserved praise for it’s huge sound which is, obviously, showcased and amplified by their dynamic live shows.","description_cy":"Mae Just Mustard yn fand pump aelod o Dundalk, Iwerddon. Yn plethu a chreu eu cymysgedd unigryw o sŵn trip hop ac electronic, mae eu halbym cyntaf ‘Wednesday’, a gafodd ei ryddhau ar Pizza Pizza Records, wedi creu argraff fawr ar y sîn gerddorol trwy gael ei enwebu fel ‘Albym y Flwyddyn’ yn Choice Music Prize 2018. Yn dilyn perfformio’n fyw yn Other Voices, Hard Working Class Hereoes a dwy daith cendlaethol yn 2018, bydd Just Mustard yn teithio dros Iwerddon, Prydain ac Ewrop yn 2019 – felly sicrhewch eich bod chi’n eu gweld yng Ngwŷl Sŵn eleni!","facebook":"https:\/\/www.facebook.com\/justmustardmusic\/","soundcloud":"https:\/\/soundcloud.com\/just-mustard","twitter":"https:\/\/twitter.com\/justmustard","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Just-Mustard.jpg"},{"id":74,"name":"KINGKHAN","description":"Cardiff is often praised for being such a complex potion of all varieties of music, all sprouting up at once, all genres, all types of musicians. From funk, to punk; there’s no end to it. King Kahn is the spearhead of Cardiffs indie rap, and meloncholy trap scene. All selp produced and self recorded, he uses fun, relatable and nostalgic sounding production styles and samples to splice together his own personal indie rap smoothie. It’s something different, and if you’re after something fresh and new, you know where to go.","description_cy":"Mae Kingkhan ar frig sîn indie rap a trap Caerdydd. Wedi’i gynhyrchu a’i recordio i gyd ei hun, mae Kingkhan yn defnyddio elfennau hwyl, hiraethus a trosglwyddadwy yn ei waith cynhurchu a’i samplau i greu smŵddi rap dinesig ei hun. Mae’n rhywbeth gwahanol ag os chi’n chwilio am rhywbeth ffres a newydd, rhowch gynnig ar Kingkhan yn ystod Sŵn!","facebook":"https:\/\/www.facebook.com\/kingkhanmusic\/","soundcloud":"https:\/\/soundcloud.com\/kingkhandotwave","twitter":"https:\/\/twitter.com\/kingKhan_music","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Kingkhan.jpg"},{"id":75,"name":"Katy J Pearson","description":"Freshly signed to Heavenly Recordings, it’s easy to see why Katy J Pearson is catching everyone’s ears. With a unique talent in creating sticky melodies that stay in the brain, Katy J Pearson writes songs that reflect her time growing up in the middle of hilly West England. After exploring the world of songwriting with dream-pop duet Ardyn, her new solo project focuses on portraying the weird and wonderful world around her. Conveying glorious nostalgia in a busy world.","description_cy":"Mae Katy J Pearson newydd gael ei chipio gan Heavenly Recordings, a mae’n hawdd gweld pam! Gyda ddawn unigryw i greu alawon sy’n glynu’n syth mewn i’r ymenydd, mae Katy J Pearson yn sgwennu caneuon sy’n adlewyrchu’i hamser yn tyfu lan yng nghanol bryniau Gorllewin Lloegr. Ar ôl ffori’r byd o sgwennu caneuon gyda’r ddeuawd dream-pop, Ardyn, mae’i phrosiect solo newydd yn canolbwyntio ar bortreadu’r byd rhyfeddol o’i chwmpas. Yn cyfleu hiraeth gogoneddus mewn byd mawr prysur.","facebook":"https:\/\/www.facebook.com\/katyjpearsonband\/","soundcloud":"https:\/\/soundcloud.com\/katyjpearson","twitter":"https:\/\/twitter.com\/KatyJPearsonnn","website":"http:\/\/heavenlyrecordings.com\/artist\/katy-j-pearson\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Katy-J-Pearson.jpg"},{"id":76,"name":"Kidsmoke","description":"Wrexham’s Kidsmoke have packed in an impressive amount in the few years since forming. An early song, Take Me To The River, found its way into and episode of Black Mirror. The Cure’s Robert Smith asked them to join his curation of the Meltdown festival. FOCUS Wales took them to Canada for the Breakout West shindig, where an invite to play SXSW came their way. But all these CV details are built on Kidsmoke’s lush music, a dreamy mix of clean guitars, intertwining vocals and irrepressible, nagging melodies.","description_cy":"Ers cychwyn ar ei gyrfa gerddorol ychydig flynyddoedd yn ôl, mae Kidsmoke wedi bod yn brysur iawn. Cafodd un o’u caneuon cynharaf Take Me To The River, ei chwarae ar bennod o Black Mirror. Gofynnwyd iddynt gan Robert Smith o The Cure os byddai diddordeb ganddyn nhw fod yn rhan o’i brosiect curadu yn Meltdown Festival. Aeth FOCUS Wales â nhw i Ganada ar gyfer y shindig Breakout West, lle estynnwyd gwahoddiad iddynt chwarae yn SXSW. Ond mae’r holl gyfleoedd yma’n deillio o gerddoriaeth hyfryd Kidsmoke, cymysgedd breuddwydiol o gitârs glân, lleisiau perffaith ac alawon anorchfygol.","facebook":"https:\/\/www.facebook.com\/kidsmokemusic\/","soundcloud":"https:\/\/soundcloud.com\/kidsmokemusic","twitter":"https:\/\/twitter.com\/Kidsmokemusic","website":"http:\/\/www.kidsmoke.co.uk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Kidsmoke.jpg"},{"id":77,"name":"Kim Hon","description":"A new project formed around members of Y Reu – Iwan Fon and Iwan Llyr – Kim Hon may only be one single old, but have already injected near-illegal amounts of swagger into the Welsh music scene. The single in question (released on the great Libertino label) is ‘Twti Ffrwti’, and is a beast of electronic beats and guitars, an addictive and not entirely serious splurge that calls to mind everything debauched from baggy, big beat to wonky hip hop like Tystion. Your party is here.","description_cy":"Ar ôl iddynt rhyddhau un sengl drwy label Libertino ac i ni weld y band yn perfformio yn Twrw Trwy’r Dydd a Dawns Barlys Aberteifi, ni wedi cwympo mewn cariad gyda’r band hudolus a gwallgof yma. Yn cyfuno curiadau electronig, guitars caethiwus a swagger pur, mae Kim Hon wedi creu sŵn sy’n atgoffaol o ‘big beat’ y 90au, hip hop wonci ag indie roc dewr a hyderus. Mae’r parti wedi cyrraedd.","facebook":"https:\/\/www.facebook.com\/kimhon420\/","soundcloud":"https:\/\/soundcloud.com\/libertinorecords","twitter":"https:\/\/twitter.com\/KIMHON420","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Kim-Hon.jpg"},{"id":78,"name":"Krush Puppies","description":"Kicking their way through a music scene rife with emotive, grungy indie rock bands like CherryGlazer, Surf Curse, and Forth Wanderers. Krush Puppies are making large strides, touring constantly and making sure they are heard in an echo chamber that’s so easy to get lost in as a new artist. Busy touring with amazing bands like Body Type and Drahla, Krush Puppies are definitely a new band to watch.","description_cy":"Mae Krush Puppies wedi bod yn cicio’i ffordd trwy’r sîn gerddorol sydd yn llawn bandiau grungy a indie fel CherryGlazer, Surf Curse a Forth Wanderes ac maent wedi bod yn gadael ei ôl, wrth deithio yn aml a gwneud yn siŵr ei bod nhw’n cael ei chlywed. Trwy deithio gyda bandiau anhygoel eraill fel Body Type a Drahla, mae Krush Puppies yn sicr yn fand i’w gweld yn fyw.","facebook":"https:\/\/www.facebook.com\/krushpuppies\/","soundcloud":"https:\/\/soundcloud.com\/user-705978756-104391847","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Krush-Puppies.jpg"},{"id":79,"name":"Lauran Hibberd","description":"Humorous, infectious and charismatic in equal measure, Isle Of Wight’s rising sensation Lauran Hibberd thrives once more with anthemic single Hoochie, firmly solidifying her growing status within the UK’s emerging indie elite. Buzzing across the airwaves with BBC Radio 1’s Annie Mac, Huw Stephens and Jack Saunders all throwing their support behind the young musician, Lauran’s witty, off-kilter approach continues to attract glowing praise from the online community (The Line Of Best Fit, Clash, The 405) and welcome comparisons to contemporaries including Courtney Barnett and Phoebe Bridgers.","description_cy":"Bag o siwgr gyda digon o hoelion, mae cerddoriaeth Lauren Hibbard yn dwyllodrus o ddiniwed. Guitar pop caethiwus ceir yma, sy’n drwm gyda hooks a hiwmor. Mae’r artist o Ynys Wyth wedi cael lle ar rhestrau chwarae Spotify a BBC yn barod a mae’n hawdd deall pam gyda’r tracks sy’n byrlymu gyda melodi a ffraeth.","facebook":"https:\/\/www.facebook.com\/lauran.hibberd\/","soundcloud":"https:\/\/soundcloud.com\/lauranhibberd","twitter":"https:\/\/twitter.com\/lauranhibberd","website":"http:\/\/www.lauranhibberd.com\/?fbclid=IwAR3qCVRBOQNb4_OZsORqrr3CfsEWCOJwlCaJMkV1geI1y9Bfy-7gAYyKmWk","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Lauran-Hibberd.jpg"},{"id":80,"name":"Lazarus Kane","description":"Who is Lazarus Kane you ask? Honestly, he’s a mystery to us too! Rumour has it that Lazarus who may have once lived in America may now reside in London where we’ve heard that he can be found dabbling with synthesisers and drum machines whilst sat upon a time machine he built himself. Some even say he’s in Katy J Pearsons band. Theres only one way to find out. ","description_cy":"Pwy yw Lazarus Kane? Cwestiwn da, mae e’n ddirgel i ni hefyd! Mae sïon bod Lazarus wedi byw yn America unwaith a nawr mae sôn bod e’n byw yn Llundain lle mae modd ei glywed yn chwarae o gwmpas gyda synthesisers a peiriannau drums tra’n eistedd ar beiriant amser nath e’ adeiladu ei hun. Ma’ rhai hyd yn oed yn gweud ei fod e’n aelod o fand Katy J Pearson. Dim ond un ffordd sydd i ffeindio mas. ","facebook":"https:\/\/www.facebook.com\/mrlazaruskane\/","soundcloud":"https:\/\/soundcloud.com\/user-998138466","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Lazarus-Kane.jpg"},{"id":81,"name":"Lice","description":"Probably the most atonal and scabrous of Bristol’s noise scene, Lice songs generally involve discordant guitar screams, pummelling drums, and, over the top, Alistair Shuttleworth’s deranged and anxious ramblings. Like post punk irritants the Birthday Party or Butthole Surfers, Lice know it feels good when it’s horrible, and this dedication to ear bashing has led to a deal with Joe from Idles’ Balley Records, and the EP collection It All Worked Out Great, which is perfect to annoy all family members with.","description_cy":"Efallai un o’r bands fwyaf digywair a chrafangllyd o sîn noise Bryste, mae caneuon LICE fel arfer yn cynnwys gitârs yn sgrechian, drymiau’n pwmpio ac ramblo pryderus a gwyllt Alistair Shuttleworth. Byddwch yn barod am set nrhagweladwy gan y punks swnllyd!","facebook":"https:\/\/www.facebook.com\/licebristol\/","soundcloud":"https:\/\/soundcloud.com\/liceband","twitter":"https:\/\/twitter.com\/licebristol","website":"https:\/\/www.balleyrecords.com\/artist\/lice\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Lice.jpg"},{"id":82,"name":"Liz Lawrence","description":"Liz Lawrence has packed a lot into the last decade. 2012 saw the release of her first album, the folk pop jewel ‘Bedroom Hero’, before she formed the electro duo Cash + David, and before she spent the best part of two years touring the world with Bombay Bicycle Club. All of which leads to 2019, and the release of new album ‘Pity Party’, a thoughtful, mature but ultimately celebratory slice of present day pop. Recent single ‘Navigator’ lays it out: a building torch song that crashes into a nagging, strident chorus, vulnerable but dead tough.","description_cy":"Mae Liz Lawrence wedi bod yn brysur iawn dros y ddegawd ddiwethaf. Rhyddhaodd Liz ei halbym gyntaf ‘Bedroom Hero’ yn 2012, yna darganfyddodd hi’r ddeuawd electro Cash + David ac yna treuliodd hi bron i ddwy flynedd yn teithio’r byd gyda Bombay Bicycle Club. Ond eleni, yn 2019, rhyddhaodd ei halbym newydd ‘Pity Party’. Yn yr albym hwn gwelwn gyfanwaith o gerddoriaeth meddylgar sy’n dathlu pob agwedd o bop. Mae ei sengl diweddaraf ‘Navigator’ fel fflam obeithiol ar y dechrau cyn i’r gytgan  grasho mewn i’r gân gan greu sŵn caled, bregus ond hyderus. ","facebook":"https:\/\/www.facebook.com\/lizlawrencemusic\/","soundcloud":"https:\/\/soundcloud.com\/lizlawrencemusic","twitter":null,"website":"http:\/\/www.lizlawrencemusic.co.uk\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Liz-Lawrence.jpg"},{"id":83,"name":"Look Mum No Computer","description":"Possibly the only act at this year’s Swn to bring an interactive synth bicycle,  Look Mum No Computer is the deviant project of Sam Battle, an experiment in fun and modified instruments now seemingly out of control. Since leaving previous band Zibra, Battle’s tinkering has drawn a cult following: as well as the playable BMX, there is the Furby Organ (4.4 million views and counting), a Gameboy orchestra, plus demonstrations of hacked stylophones, bibles and God knows what else. Part electropop showman, part rave Techniquest, overall it’s just a party. ","description_cy":"Efallai mai hwn yw’r unig berfformiwr yn Sŵn sy’n dod â beic synth rhyngweithiol i’r llwyfan. Mae Look Mum No Computer yn brosiect gan Sam Battle, yn arbrawf hwyl sy’n addasu offerynnau mewn i bethau hollol gwallgof. Ers gadael ei fand baenorol Zibra, mae addasiadau Zibra wedi creu rhyw fath o gwlt: yn ogystal i’r BMX sy’n gallu cael ei chwarae ma na Organ Furby (wedi’i wylio 4.4 miliwn gwaith), cerddorfa Gameboy, perfformiadau ar stylophones wedi’i hacio, beiblau a duw a wyr beth arall! Yn hanner electropop, hanner rêf yn Techniquest a 100% parti. ","facebook":"https:\/\/www.facebook.com\/LOOKMUMNOCOMPUTER\/","soundcloud":"https:\/\/soundcloud.com\/lookmumnocomputer","twitter":"https:\/\/twitter.com\/LOOKMUMNOCMPUTR","website":"https:\/\/www.lookmumnocomputer.com","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/LMNC.jpg"},{"id":84,"name":"Lunar Bird","description":"The psychedelic trail from Italy to Cardiff might not be the most well-trodden, but Lunar Bird’s relocation at least gives us some gloriously addled, lush dreampop. Based around Roberta Musillami and Eliseo Di Malto’s vocals and synth swirls, recent EP Daydreamer is a delicious treat, recalling Goldfrapp, Melody’s Echo Chamber, or even Kate Bush’s more gothic touches. Get enchanted.","description_cy":"Diolch byth y ffeindiodd Lunar Bird y llwybr seicadelig o’r Eidal i Gaerdydd.  Wedi nythu yng Nghaerdydd erbyn hyn mae Lunar Bird yn creu dreampop anhygoel. Yn seiliedig ar leisiau Roberta Musillami ac Eliseo Di Malto, mae eu EP diweddaraf yn gyfanwaith blasus sy’n debyg i Goldfrapp, Melody’s Echo Chamber, neu hyd yn oed elfennau gothig Kate Bush. ","facebook":"https:\/\/www.facebook.com\/lunarbirdofficial\/","soundcloud":"https:\/\/soundcloud.com\/user-196428527","twitter":"https:\/\/twitter.com\/lunarbirdband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Lunar-Bird.jpg"},{"id":85,"name":"Macy","description":"Another young pop prodigy under Forté Project’s wing, Macy is already making a name for herself in the Welsh pop scene with appearances at Focus Wales and Hub Festival. Recently, she’s been working hard developing her dark pop and honing her craft by deconstructing pop songs, collaborating with producers and experimenting with the capabilities of the studio. You can witness some of her own powerful twists on pop hits on her Soundcloud. Look out for her forthcoming single, ‘Cinema’.","description_cy":"Yn aelod arall o’r Prosiect Forte, mae Macy wedi dod yn enw cyfarwydd o fewn y sîn pop Cymreig ar ôl perfformio yn Focus Wales a Gwyl Hub. Yn ddiweddar, bu’n gweithio’n galed yn datblygu ei pop tywyll ac yn mireinio ei chrefft wrth ddatgymalu caneuon pop, gweithio gyda chynhyrchwyr gwahanol ac arbrofi gyda ffiniau stiwdio traddodiadol. Ewch i wrando ar ganeuon pop poblogaidd yn cael eu plygu a’u troi gan Macy ar ei Soundcloud. Cadwch lygaid allan am ei sengl nesaf ‘Cinema’. ","facebook":"https:\/\/www.facebook.com\/MacyMusic\/","soundcloud":"https:\/\/soundcloud.com\/macy_music","twitter":"https:\/\/twitter.com\/Macy_Music","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Macy.jpg"},{"id":86,"name":"Melin Melyn","description":"Lovely psychedelic country pop from these London based Cardiff and North Walians. Their vintage-country-surf-twang and songs packed with a cast of curious characters will leave fans of Euros Childs \/ Gorkys etc. beaming from ear to ear. With their debut EP you can get some idea of the melodic zing they are capable of.","description_cy":"Mae Melin Melyn yn creu pop vintage bachog ag ecsentrig sy’n adrodd straeon rhyfedd, fel rhaglen plant seicadelig. Wrth gyfuno elfennau surf, gwerin a psychedelia hafaidd, mae’r band yn creu naws chwilfrydig sy’n barod i esgyn o un byd hudol i’r llall. ","facebook":"https:\/\/www.facebook.com\/MelinMelynBand\/","soundcloud":"https:\/\/soundcloud.com\/melin-melyn","twitter":"https:\/\/twitter.com\/melin_melynband","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Melin-Melyn.jpg"},{"id":87,"name":"Modern Habits","description":"Local three piece Modern Habits put their mind, body and soul into churning out their unique breed of cathartic post punk. Their music is personal and genuine and specific to the daily trials of their lives. They just want their audience to feel and relate and be moved as they play, and hopefully you will.","description_cy":"Mae’r triawd lleol Modern Habits yn rhoi eu meddwl, corff ac enaid i greu eu cymysg unigryw o ol-pync cathartig. Mae eu cerddoriaeth yn bersonol, dilys ac yn benodol i’w sialens fywydol. Maent dim ond eisiau i’w cynulleidfa i deimlo ac uniaethu wrth iddynt chwarae, a ni’n gobeithio y byddech chi!","facebook":"https:\/\/www.facebook.com\/wearemodernhabits\/","soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Modern-Habits-1.jpg"},{"id":88,"name":"Mr","description":"The latest project from Mark Roberts, the guitarist and founder of a string of Welsh icons (Y Cyrff, Catatonia, Y Ffyrc, The Earth), MR is Mark solo, and Oesoedd is his debut album (and so anticipated it sold out its initial run in three days). You can see the progression through all of his acts arriving here: Oesoedd fits battered but classic songwriting and flashes of brass and black humour into its 12 tracks, for a happy, beloved return.","description_cy":"Prosiect diweddaraf yr arloswr y sîn gerddorol yng nghymru, Mark Roberts (Y Cyrff, Catatonia, Y Ffyrc, The Earth), yw MR. Fe werthodd album cyntaf MR mas mewn tridiau! Gallwch weld dilyniant trwy bob un o’i actau yma: mae Oesoedd yn ffitio’r ysgrifennu clasurol gyda fflachiau o offerynnau pres a hiwmor tywyll yn ei 12 trac. Dychweliad hyfryd ag annwyl gan yr eicon pwysig yma.","facebook":null,"soundcloud":null,"twitter":"https:\/\/twitter.com\/Mrcyrff","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/MR-1.jpg"},{"id":89,"name":"Murder Capital (THE)","description":"At first glance the dark and gloomy foreboding post-punk of this Dublin quintet might make you assume a bleak lyrical worldview however there is always hope and tenderness not far from the murky surface. Their debut album produced by the legendary Flood makes a valiant attempt at bottling the lightning of the sheer intensity and prowling menace of their live shows.","description_cy":"Petai chi’n mynd i weld The Murder Capital yn fyw, nid trymder, llymder na chynddaredd y caneuon fyddai’n denu’ch sylw ond yr eiliadau fwyaf eithriadol o dynerwch. Cafodd eu halbym cyntaf ‘When I Have Fears’ ei recordio dros Spring With Flood (PJ Harvey, Nick Cave & The Bad Seeds, New Order ayyb) ac yn yr albym fe welwn ni’r tynerwch yma yn glir; yn glais piws ar benglin caled yr adfywiad ôl-bync.","facebook":"https:\/\/www.facebook.com\/MurdrCapitalBand\/","soundcloud":"https:\/\/soundcloud.com\/themurdercapital","twitter":"https:\/\/twitter.com\/MurderCapital_","website":"https:\/\/themurdercapital.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/The-Murder-Capital.jpg"},{"id":90,"name":"Mystic Peach","description":"Fruit come in all sorts of mysterious shapes and sizes, but this punnet comes in the shape of three indie rockers from Southampton. Mystic Peach create tasty slacker pop, bouncing from crunching guitars, bodacious choruses and tuneful melodies. ","description_cy":"Dyma fand o Southampton sy’n creu slacker pop blasus sy’n bownsio o guitars crensiog, cytganau craff ag alawon swynol. Dewch i weld y ffrwyth direglus yma!","facebook":"https:\/\/www.facebook.com\/MysticPeachh\/","soundcloud":"https:\/\/soundcloud.com\/mysticpeachh","twitter":"https:\/\/twitter.com\/mysticpeachh","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Mystic-Peach.jpg"},{"id":91,"name":"Natty Paynter","description":"Story-telling is at the forefront of Cardiff’s Natty Paynter’s song-writing as she delves into exploring her craft. On ‘Bird’ she strips everything back to the absolute minimum and let’s her haunting, fragile vocals do the work. On ‘Astronaut’ she shows-off her ability to craft a delightfully enchanting melody. At such a young age, her offering so far is outstanding – this is just the beginning for this promising artist.","description_cy":"Wrth fynd ati i ysgrifennu cerddoriaeth, mae adrodd stori yn nodwedd holl-bwysig i Natty Paynter. Yn ‘Bird’ mae’n llwyddo i gadw popeth yn finimilistaidd and yn gadael i’w llais bregus a brawychus wneud y gwaith. Yn ‘Astonaut’ gwelwn Paynter yn arddangos ei dawn arbennig o greu melodi arbennig. Er yn ifanc, mae ei gwaith hyd yn hyd yn anhygoel – dim ond cychwyn ei siwrne yw hyn.","facebook":"https:\/\/www.facebook.com\/nattypaynteruk\/","soundcloud":"https:\/\/soundcloud.com\/nattypaynter","twitter":"https:\/\/twitter.com\/nattypaynter","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Natty-Paynter.jpg"},{"id":92,"name":"Nilüfer Yanya","description":"Nilüfer Yanya has been composing songs in her head since she was 6 years old, and has been writing songs on guitar since she was 12, but it took time for her to gain the confidence to show her music to anyone. Once she did, this was her response – “it was horrendous, I loved it”. She thanks her creative home and family for encouraging her and pushing her to release and perform her music.","description_cy":"Mae Nilüfer Yanya wedi bod yn cyfansoddi caneuon yn ei phen ers yn chwe mlwydd oed, ac wedi bod yn ysgrifennu caneuon ar y gitar ers yn 12, ond cymerodd hi amser hir iddi fagu hyder i ddangos ei cherddoriaeth i unrhywun. Unwaith iddi ddangos ei gwaith dyma oedd ei hymateb – “Roedd e’n erchyll, nes i garu e”. Mae’n diolch i’w haelwyd a’u theulu greadigol am ei hannog a’i gwthio i ryddhau a pherfformio ei cherddoriaeth. ","facebook":"https:\/\/www.facebook.com\/niluferyanya\/","soundcloud":"https:\/\/soundcloud.com\/niluferyanya","twitter":"https:\/\/twitter.com\/niluferyanya","website":"http:\/\/www.niluferyanya.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Nilufer-Yanya-1.jpg"},{"id":93,"name":"Obey Cobra","description":"The South Wales psychedelic super group Obey Cobra are carrying the local doom\/metal scene on the weight of their backs currently. Converging the worlds of doom metal, stoner rock and electronic ambience. Fronted by singer Kate Woodward who projects her haunting ephemeral voice over a slow, deep and hammering backbeat, this brings to mind other artists like Chelsea Woolf who’s combination of gothic doom rock and ambient siren song is definitely comparable to say the least. Okay Cobra will definitely be one of the heaviest and darkest acts at Sŵn this year and definitely not one to miss.","description_cy":"Mae’r swpyr-grŵp yma, Obey Cobra yn dod o Gaerdydd ac maent yn cario’r sîn metal\/dŵm yn drwm ar eu hysgwyddau. Yn cyfuno cerddoriaeth metal dŵm, roc stoner gyda ambience electronig. Wedi’u harwain gan y cantoers Kate Woodward sy’n taflu eu llais brawychus dros guriadau araf trwm a dwfn mae’r sŵn yn ymdebygi i sŵn unigryw a gothig Chelsea Woolf. Cobra bydd un o fandiau mwyaf trwm a thywyll Sŵn felly mae’n rhaid i chi weld nhw, iawn?! ","facebook":"https:\/\/www.facebook.com\/obeycobramusic\/","soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Obey-Cobra.jpg"},{"id":94,"name":"Orchards","description":"The trojan horse on Big Scary Monsters’ roster, Orchards smuggle massive fluffy hooks into their fiddly math rock bangers, leaving you both humming melodies and admiring fret-tapping. A manic pop splurge from Brighton, the key to Orchards lies in Lucy Evers’s soaring vocals meeting guitarist Sam Rushton’s equally flying riffwork, a kind of action painting for the ears. That they compress all this into three minutes pop nuggets is a service to their country.","description_cy":"Ceffyl trojan ar restr Big Scary Monster, mae Orchards yn smyglo bachau enfawr mewn i’w tiwns roc-math. Mi fyddech chi’n cerdded i ffwrdd yn hwmio’r alawon. Sblash o pop o Brighton, mae’r harddwch o Orchards yn gorffwys yn llais Lucy Ever’s sy’n hedfan dros riffs y gitarydd Sam Rushton. Pop can yn 3 munud o pop sy’n wasanaeth i’w wlad.","facebook":"https:\/\/www.facebook.com\/orchardslive\/","soundcloud":"https:\/\/soundcloud.com\/orchardslive","twitter":"https:\/\/twitter.com\/Orchardslive","website":"https:\/\/www.orchardslive.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Orchards.jpg"},{"id":95,"name":"Owain Felstead","description":"Already a finalist in a national songwriting competition while finishing his GCSEs, Cardiff’s Owain Felstead is both precocious and prodigious, a dab hand at well-crafted tracks for years now. Far from a glorified busker with a cheap amp, Felstead’s singer-songwriting spotlights mature dissection of relationships, modern pop production flourishes surrounding luxurious and confident vocals. Whether performing solo or writing killers for others, the future looks rosy here. ","description_cy":"Tra’n gorffen ei arholiadau TGAU, cyrhaeddodd Owain Felstead rownd derfynol mewn cystadleuaeth cyfansoddi cenedlaethol. Mae’r dyn ifanc o Gaerdydd yn dalentog tu hwnt ac yn gallu troi ei law at grefftio tracs yn hawdd ers rhai blynyddoedd bellach. Yn bell o fod yn fysgiwr gwael yn canu trwy amp rhad, mae’r canwr\/cyfansoddwr yn rhoi perthnasau o dan y chwydd wydr wrth ganu ac yn creu cynhyrchiad pop fodern o gwmpas ei lais moethus a hyderus. Yn perfformio ar ben ei hun, neu’n ysgrifennu tracs anhygoel i bobl eraill, mae dyfodol Felstead yn edrych yn ddisglair. ","facebook":"https:\/\/www.facebook.com\/owainfelsteadMusic\/","soundcloud":null,"twitter":"https:\/\/twitter.com\/owainfelstead","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Owain-Felstead.jpg"},{"id":96,"name":"Pagan Wanderer Lu","description":"Bolton born \/ Cardiff bred Andrew Paul Regan has developed his own unique brand of intelligent pop-music (a more accessible tUnE-yArDs \/ a perkier Mark E Smith) over a number of years and almost as many name changes as Thee Oh Sees. His recently assembled band of Cardiff all-stars have ousted his trusty laptop and breathe life into his incredible music which leaves his razor sharp dry wit free to roam.","description_cy":"Artist lleol sydd wedi bod ar y sin ers blynyddoedd, mae Pagan Wanderer Lu (anagram o enw’r cyfansoddwr; Andrew Paul Regan) yn cyfuno ffraeth, hiwmor, doethineb a chawl blasus o synau gwerin ag analog synths. Mae’r gerddoriaeth yn chwareus a hynod o fachog ag amrwd sydd wirioneddol yn dangos potensial agwedd rhagweithiol a dulliau DIY. ","facebook":"https:\/\/www.facebook.com\/paganwandererlu\/","soundcloud":"https:\/\/soundcloud.com\/paganwandererlu","twitter":"https:\/\/twitter.com\/paganwandererlu","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Pagan-Wanderer-Lu.jpg"},{"id":97,"name":"Papur Wal","description":"Another in the top roster that Libertino Records have been assembling recently, Cardiff-via-North-Wales band Papur Wal have their slacker vibes absolutely nailed, issuing a stream of singles from the well-horizontal end of the rock spectrum. Latest track Dyddiau Well I Ddod is their best yet – slow, fuzzy guitar notes underpinning hazy vocals before crashing together in a brief burst of noise, early Pavement meeting Dinosaur Jr at chucking out time.","description_cy":"Yn un arall ar frig rhestr Recordiau Libertino o fandiau, mae’r band o Gaerdydd-via-Gogledd-Cymru wedi maestroli eu vibes slacyr roc, wrth rhyddhau sawl sengl sy’n eistedd yn gyfforddus ar y sbectrwm roc. Mae eu trac diweddaraf ‘Mae’r Dyddiau Gwell i Ddod’ yn arddangos y band ar eu gorau – nodau gitar araf, aneglur a fuzzy, gyda llais ymlaciol a diog yn clasio a chwalu yn erbyn ei gilydd mewn cyfnod byr a sydyn, Pavement cynnar yn cyfarfod â Dinosaur Jr. ","facebook":"https:\/\/www.facebook.com\/papurval\/","soundcloud":"https:\/\/soundcloud.com\/user-544168091","twitter":"https:\/\/twitter.com\/papurwal","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Papur-Wal.jpg"},{"id":98,"name":"Patawawa","description":"Sparkly DIY disco pop from Matlock in Derbyshire. Patawawa are as groovy as their name audibly sounds. Far out hooks straight from Nile Rodgers’ lost tapes combined with shimmering synths and blood-pumping beats – Patawawa will uplift the heaviest souls and add colour to the dullest days. Bring your dancing shoes or don’t – it won’t matter – your feet will be moving and your day will shine.","description_cy":"Mae Patawawa yn creu disco pop befriog a mae nhw mor groovy a sut ma’u enw yn swnio i’r glust. Bachau ecsentrig yn syth o dapiau coll Nile Rodgers wedi’i gyfuno gyda synths ysblennydd a curiadau i bwmpio’ch gwaed o’ch pen, lawr i’ch traed a nol lan i’ch pen eto. Neuth Patawawa adio lliw i’r dyddiau mwyaf diflas. Dewch a’ch sgidiau dawnsio neu beidio – mi fydd eich traed yn symud.","facebook":"https:\/\/www.facebook.com\/patawawa\/","soundcloud":"https:\/\/soundcloud.com\/patawawa","twitter":"https:\/\/twitter.com\/patawawa","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Patawawa.jpg"},{"id":99,"name":"Pengshui","description":"Oh, this is going to take the roof off. A delirious, furious mix of grime, hip-hop and rock noise, the volume and energy at a PENGSHUi gig takes no prisoners. A meeting of minds all busy with other disparate projects (bassist Fatty from Submotion Orchestra and Newham Generals, Golide MC Illaman, drummer Pravvy Prav of Foreign Beggars and Jehst), PENGSHUi are a huge crash of mad guitars and spat-out vocals, and will have your brain, and whatever venue that play, like rubble.","description_cy":"Bydd PENGSHUi yn codi’r to. Cymysgedd perffaith o grime, hip-hop a roc yw Penshui sy’n ffrwydiad enfawr o egni. Yn brysur tu hwnt gyda sawl prosiect arall (Fatty, y basydd o Submotion Orchestra a Newham Generals, a Golide MC Illaman, drymiwr Pravvy Prav o Foreign Beggars a Jehst) mae PENGSHUi yn wrthdrawiad o gitars gwallgof a lleisiau swnllyd sy’n sicr o ddinistrio dy ymennydd neu’r lleoliad. ","facebook":"https:\/\/www.facebook.com\/pengshuimusic\/","soundcloud":"https:\/\/soundcloud.com\/pengshuimusic","twitter":"https:\/\/twitter.com\/ILLAMAN","website":"https:\/\/patawawa.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Pengshui.jpg"},{"id":100,"name":"Pigsx7","description":"It’s been absolutely great to see the Pigs’ brutal ascent, selling out bigger and bigger venues while not compromising one inch of heaviosity. A vital cog in Newcastle’s sweaty and fertile music scene – vocalist Matt Baty has released Lower Slaughter, Terminal Cheesecake and more on his Box label, two Pigs play in Richard Dawson’s band – Pigsx7 have been building their fearsome live reputation for a few years now, earning worship through punishing doom riffs and metallic howling. Their debut album Feed The Rats twisted heavy rock into long, pummeling shapes; latest LP King Of Cowards condenses all the euphoric anguish into leaner, still devastating attacks. They’ll kill you, you’ll like it.","description_cy":"Mae wedi bod yn wych gwylio Pigs Pigs Pigs Pigs Pigs Pigs Pigs yn dringo’n gadarn i’r uchelfannau, yn gwerthu pob tocyn i sawl lleoliad enfawr, heb aberthu un fodfedd o drymder. Yn allwedd hanfodol i sîn gerddoriaeth chwyslyd a chynhyrchiol Newcastle – mae’r prif leisydd, Matt Baty wedi rhyddhau Lower Slaughter, Terminal Cheesecake a mwy ar ei label Box, mae na ddau fochyn arall yn chwarae ym mand Richard Dawson –  Mae Pigsx7 wedi bod ennyn eu parch yn fyw ers rhai blynyddoedd bellach ac erbyn hyn yn cael ei addoli gan y dorf trwy’r sgrechfeydd metelig a’i riffs tywyll. Mae eu LP diweddaraf King of Cowards yn cyddwyso’r holl ofid ewfforig mewn i ymosodiadau dinistriol. Byddwch yn barod i fwynhau cael ei lladd gan y Pigs Pigs Pigs Pigs Pigs Pigs Pigs. ","facebook":"https:\/\/www.facebook.com\/PigsPigsPigsPigsPigsPigsPigs\/","soundcloud":"https:\/\/soundcloud.com\/pigspigspigspigspigspigspigs","twitter":"https:\/\/twitter.com\/Pigsx7","website":"https:\/\/www.pigsx7.co.uk\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Pigs-Pigs-Pigs-Pigs-Pigs-Pigs-Pigs.jpg"},{"id":101,"name":"Plastic Estate","description":"In the thick of a trend of 80s synth pop revival, with bands like Porches, Drab Majesty and HMLTD populating the front lines. New bands like Cardiffs very own Plastic Estate are popping up like daisies. But for sure, theirs is a name that without a doubt you’ll be hearing more and more from in the coming years. The five piece paste all their influences proudly decorating their sleeves in the two singles they’ve released so far, the latter of which being “Cremation” which sounds like a splicing of The La’s and Choirboy. The sexiest kind of amalgamation that we could certainly do with more of in my life.","description_cy":"Mae Plastic Estate o Gaerdydd yn cymryd eu lle yn daclus mewn atgyfodiad 80au synth pop gyda bandiau fel Porches, Drab Majesty a HMLTD. Yn sicr, mae Plastic Estate yn enw y byddwch yn clywed fwyfwy dros y blynyddoedd nesaf. Clywn eu dylanwadau yn glir yn eu dwy sengl diweddaraf – gyda ‘Cremation’ yn swnio fel cyfuniad perffaith rhwng The La’s a Choirboy. ","facebook":"https:\/\/www.facebook.com\/plasticestate\/","soundcloud":"https:\/\/soundcloud.com\/plastic-estate","twitter":"https:\/\/twitter.com\/plasticestate","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Plastic-Estate.jpg"},{"id":102,"name":"Porridge Radio","description":"Initially the outlet for Dana Margolin’s brilliantly weirdo solo experiments, over the last few years Porridge Radio has become a collection of more or Brighton’s outcasts, and a gang fleshing out Margolin’s songs and ricocheting into other directions. Affiliated with Brighton’s other premier oddpoppers Garden Centre, Porridge Radio songs are a ramshackle rabble of guitar, keyboards and repeated vocals, absurdism treated with the same import as profundity. Or: pure wonky gold.","description_cy":"Yn wreiddiol, allfa i arbrofion unigol od a gwych Dana Margolin oedd Prridge Radio, sydd wedi datblygu dros y blynyddoedd i gynnwys casgliad o artistiaid o Brighton yn ymuno fewn gyda’r hwyl.  Mae’r artistiaid ychwanegol wedi adlamu’r prosiect i gyfeiriadau cyffroes gwahanol. Trysor wonci pur.","facebook":"https:\/\/www.facebook.com\/porridgeradio\/","soundcloud":"https:\/\/soundcloud.com\/porridgeradio","twitter":"https:\/\/twitter.com\/porridgeradio","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Porridge-Radio.jpg"},{"id":103,"name":"Pozi","description":"Freshly formed in 2018, this South London trio utilise drums, bass and violin to generate jarring and minimalistic post-punk that captures with a firm grip. Their live show is haunted with a unique intensity that is minimal yet powerful.","description_cy":"Wedi’i ffurfio yn 2018, mae’r triawd yma o Dde Llundain yn defnyddio dryms, bass a ffidl i greu ol-pync minimalaidd sy’n eich denu a’ch gafael yn gadarn. Mae eu sioe byw yn eich aflonyddu gyda dwyster unigryw pwerus.","facebook":"https:\/\/www.facebook.com\/poziband\/","soundcloud":"https:\/\/soundcloud.com\/pozi-music","twitter":"https:\/\/twitter.com\/poziband","website":"https:\/\/www.musicglue.com\/pozi\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Pozi.jpg"},{"id":104,"name":"Raf Rundell","description":"Through his solo work and his work with The 2 Bears and his countless projects and collaborations, Raf Rundell is one of Britain’s hardest-working musical characters. Blending his endless influences and talents, Raf Rundell creates uplifting electronic music with spliced up beats and funky hooks. He brings his new album O.M.GOD to life at Swn Festival this year. ","description_cy":"Ar ôl gwneud gwaith unigol, gweithio gyda The 2 Bears, cyd-weithio gyda sawl cerddor a gwneud sawl prosiect – Raf Rundell yw un o gerddorion mwyaf gweithgar Prydain. Wrth gyfuno ei ddawn a’i ddylanwadau, mae Raf Rundell yn creu cerddoriaeth electronig sy’n codi’r galon gyda curiadau cymhleth a hooks ffynci! Bydd cyfle i glywed ei albym newydd O.M.GOD yn Sŵn eleni. ","facebook":"https:\/\/www.facebook.com\/RafRundell\/","soundcloud":"https:\/\/soundcloud.com\/rafrundell","twitter":"https:\/\/twitter.com\/RafRundell","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Raf-Rundell.jpg"},{"id":105,"name":"Rainbow Maniac","description":"Rainbow Maniac arrived into the Cardiff scene circa 2017 with tremendous vigour. They emerged stocked full of tunes, and an evident, urgent will to make noise. Taking the wry, subtly enigmatic words and thoughts of chief lyricist Conor Latcham as their pivoting foundation, tracks lurch from knowing cultural reference to jaggedly aloof home truths.","description_cy":"Roc glochaidd pur o Gaerdydd-trwy-Pen Y Bont, Rainbow Maniac yw un o’r bandiau mwya’ aflafar o grombil newydd sin y brif-ddinas. Fel brwydr yn Wetherspoons chi’n gallu dawnsio iddo, mae’u caneuon yn gweld y band yn coginio cawl blasus o swagger Arctic Monkeys, blues rock The black Keys a grunge trwm Bush. Mae nhw’n gaddo album yn fuan - byddwch yn ofn a byddwch yn feddw.","facebook":"https:\/\/www.facebook.com\/rainbowmaniac\/","soundcloud":"https:\/\/soundcloud.com\/rainbow-maniac","twitter":"https:\/\/twitter.com\/RainbowManiaccc","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Rainbow.jpg"},{"id":106,"name":"Ritual Cloak","description":"Ritual Cloak are Daniel Barnett (formerly of Samoans) and exquisite producer, Andrew Sanders. The two met when they were both recruited to form Jemma Roper’s backing band and after Daniel’s band Samoans split up, the duo joined forces to form Ritual Cloak. Latest track – ‘Everyone Is Hungover So I Walked The Mountain Alone’ is a misty concoction of glitchy minimal beats and climactic electronic ambience – it proves their united force is a masterful beast, in complete control of its direction.","description_cy":"Daniel Barnett (Samoans) a’r cynhyrchydd Andrew Sanders yw Ritual Cloak. Fe gyd-weithodd y ddau am y tro cyntaf drwy chwarae fel band cefndirol i Jemma Roper ag ar ol i Samoans, band Daniel wahanu, fe ymunodd y ddau i greu Ritual Cloak. Mae’r track diweddaraf, ‘Everyone Is Hungover So I Walked The Mountain Alone’ yn gymysgedd niwlog o guriadau glitchy minimalaidd a synau electroneg amgylchyddol – mae’n profi bod grym unedig y ddau yn fwystfil meistrolgar, mewn rheolaeth llwyr o’u cyfeiriad.","facebook":null,"soundcloud":"https:\/\/soundcloud.com\/ritualcloak","twitter":"https:\/\/twitter.com\/ritualcloak","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Ritual-Cloak.jpg"},{"id":107,"name":"Rosehip Teahouse","description":"Formerly the tentative solo recordings of Cardiff resident Faye Rogers, Rosehip Teahouse has recently blossomed into glorious full band mode, fleshing out Rogers’ spellbinding folk pop songs and creating something touching and unique. Though sharing members with other local heroes Live, Do Nothing, Oh Peas and more, RT is very different, making lilting, happysad music such as recent single Same Sky: a rush of lovelorn imagery, chiming guitars and scattershot backing vocals. Cardiff’s best kept secret for how long?","description_cy":"Yn dilyn recordio sawl cân yn unigol, mae Faye Rogers o Rosehip Teahouse erbyn hyn wedi ffeindio band i roi sain llawn, mawr a gogoneddus i ganeuon pop gwerin swynol Rogers. Yn defnyddio aelodau o fandiau eraill fel Live, Do Nothing, Oh Peas a mwy mae Rosehip Teahose yn creu cerddoriaeth chwerwfelys. Cân sy’n llawn gitars cariadus a lleisiau cefndirol scattershot yw ei sengl ddiweddaraf Same Sky. Mae Rosehip Teahouse un o gyfrinachau gorau Caerdydd, ond am ba hyd? ","facebook":"https:\/\/www.facebook.com\/rosehipteahouse\/","soundcloud":"https:\/\/soundcloud.com\/rosehipteahouse","twitter":"https:\/\/twitter.com\/rosehipteahouse","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Rosehip-Teahouse.jpg"},{"id":108,"name":"Rosie Lowe","description":"An expert at dissecting the heartbreak and love of modern life, Rosie Lowe also crafts songs that gleam with a hybrid of pop, soul and delicate electronica. Recent second album ‘YU’ contains contributions from the likes of Floating Points and Jay Electronica, but is all about Lowe’s songs: gorgeous slow-burners that pulse with machine noise or choral backing, while Lowe’s vocals skip almost jazz-like between the gaps. Highly swoonworthy.","description_cy":"Arbennigwr mewn dadelfennu cariad a’i natur i dorri calonnau yn bywyd modern, mae Rosie Lowe yn crefftio caneuon sy’n disgleirio gyda chymysg o pop, soul ac electronica cain. Mae’r ail albwm ‘YU’ yn cynnwys cyfranniadau gan Floating Points a Jay Electronica, ond caneuon Lowe yw canolbwynt y gwaith: caneuon prydferth sy’n llosgi’n araf ac yn pylsio gyda sain periannol neu lleisiau côr, tra bod llais Lowe yn sgipio trwy’r bylchau. ","facebook":"https:\/\/www.facebook.com\/rosielowemusic\/","soundcloud":"https:\/\/soundcloud.com\/rosielowe","twitter":"https:\/\/twitter.com\/rosielowemusic","website":"https:\/\/rosielowe.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Rosie-Lowe.jpg"},{"id":109,"name":"Rozi Plain ","description":"Some people travel around the world, collecting new experiences and sounds, then return home the same wonderful friend as before. There’s an immediately welcoming quality to Rozi Plain’s folk music, no matter the off kilter sounds and wandering delivery. An underrated and inventive guitarist, Plain’s vocal style also plays with space and texture, creating a disorientating and magical effect. New album What A Boost features Dan Leavers of The Comet Is Coming, folk dude Sam Amidon, Rachel Horwood of Bamboo and Trash Kit and more, and is a truly beautiful journey through enchanting sound. A real treasure.","description_cy":"Mai rhai pobl yn teithio o gwmpas y byd, yn casglu profiadau a synau newydd, yna yn dychwelyd adref i’r un ffrindiau anhygoel fel y blaen. Mae yna ansawdd croesawus yn syth i gerddoriaeth werin Rozi Plain. Gitarist tanseiliedig a ddyfeisgar, mae steil canu Plain yn chwarae gyda gofod a gwead, yn creu effaith hudol i’ch drysu.","facebook":"https:\/\/www.facebook.com\/roziplain\/","soundcloud":"https:\/\/soundcloud.com\/rozi-plain","twitter":"https:\/\/twitter.com\/ROZIPLAIN","website":"http:\/\/roziplain.co.uk\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Rozi-Plain.jpg"},{"id":110,"name":"Ruthie","description":"Once the vocalist in Leeds’ garage rock sluggers Bruising, Naomi Baguley’s new project is Ruthie, a near-180 degree swerve to epically sad, piano-led songs of love and fractured relationships. Wrapped in a hazy sound that occasionally erupts into beautifully tasteful full band wig-outs, the core of songs like ‘Land Of My Lover’ and ‘Spirit Now Moves’ are Baguley’s soft vocals and poetic imagery, retro-tinged singer-songwriting both classically tuned and quietly fierce. ","description_cy":"Falle bod chi’n nabod Naomi Baguley fel cantores o’r band garage rock o Leeds, Bruising, dyma ei phrosiect newydd, Ruthie. Yn troi 180 gradd o’i chefndir stwrllyd i greu caneuon lleddfus a trist gyda’i phiano. Wedi’i lapio mewn swn niwlog sy’n ffrwydro bob hyn a hyn mewn i wig-outs prydferth gyda band llawn. Gyda dawn clasurol a gallu ffyrnig, mae Ruthie yn rhywbeth arbennig.","facebook":"https:\/\/www.facebook.com\/ruthiesongs\/","soundcloud":"https:\/\/soundcloud.com\/ruthiesongs","twitter":"https:\/\/twitter.com\/ruthiesongs_","website":"https:\/\/www.ruthiesongs.com\/?fbclid=IwAR3PJcLd3pYLYBE0d2kGabsLVRMn3RYwoC_TOTiWiK1abGL0DjToYKkvvs8","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Ruthie.jpg"},{"id":111,"name":"Saint Agnes","description":"A fixture in London’s more disreputable venues for some time now, Saint Agnes are a strutting blues rock peacock, wailing guitar pyrotechnics meeting Kitty Austen’s queen-of-the-world vocal fire. Songs like Sister Electric stomp like Godzilla, Dead Weather meeting AC\/DC in a desert bar at high noon. You see? Saint Agnes do things to you.","description_cy":"Lle mae gitars gwyllt a llais brenhinol Kitty Austen yn cwrdd, mae Saint Agnes yn fand blues roc o Lundain. Yn y gân Sister Electric mae’r sain yn yn stompio ar lawr fel Godzilla ac yn ffrwydo fel Dead Weather yn cwrdd ag AC\/DC mewn bar gwag yng nghanol y prynhawn. Ti’n gweld? Mae Saint Agnes yn gwneud pethau dwl i dy ben di. ","facebook":"https:\/\/www.facebook.com\/wearesaintagnes\/","soundcloud":"https:\/\/soundcloud.com\/saintagnes","twitter":"https:\/\/twitter.com\/WeareSaintAgnes","website":"http:\/\/www.wearesaintagnes.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Saint-Agnes.jpg"},{"id":112,"name":"Sam Calver","description":"Seasoned singer songwriter hailing from Hastings, Sam Calver is the infectious heart throb that we’re all looking for. Performing to huge audiences around the UK and wooing them all effortlessly and gaining a devoted following. Calver has the soulful magic about him that hold him comparable to the best of the best in the singer, songwriter world like Adele, Ed Sheehan and George Ezra.","description_cy":"Mae Sam Calver, yn artist unigol yn wreiddiol o Hastings ac mae ei ganeuon yn rhai sydd aros gyda chi am amser hir. Mae wedi bod yn perfformio i gynulleidfaoedd anferthol o gwmpas y DU gan ennill cefnogaeth o bob cwr o’r wlad. Mae ei ganeuon yn falm i’r enaid ac mae ei lais hudolus yn wefreiddiol yn debyg i Adele, Ed Sheeran a George Ezra.","facebook":"https:\/\/www.facebook.com\/Samcalvermusic\/","soundcloud":"https:\/\/soundcloud.com\/sam-calver","twitter":"https:\/\/twitter.com\/Samcalvermusic","website":"http:\/\/www.samcalver.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Sam-Calver.jpg"},{"id":113,"name":"Scalping","description":"More miscreants from the Bristol underground, Scalping play a techno-addled post punk that finds equal space for acid squelches and taut guitar throb. Dark and instrumental, their gigs fuse immersive, specially prepared visuals with an unyielding, propulsive flow of rhythm, while release-wise, their recent ChamberEP merges synth and 303 prongs with spiky guitar like some dream basement party.","description_cy":"Yn cropian fyny o’r byd tanddaearol ym Mryste mae Scalping yn chwarae cerddoriaeth techno ôl-bync sy’n rhoi lle cyfartal i sgrechfeydd acid a gitars gwlyb. Yn dywyll ac yn offerynnol, mae gigs Scalping yn cyfuno visuals wedi’u paratoi o flaen llaw gyda rhythm angerddol a chyson. Yn ei EP diweddaraf Chamber, gwelwn synth a prongs 303 yn cael ei asio at ei gilydd i greu y parti tanddaearol gorau erioed. ","facebook":"https:\/\/www.facebook.com\/scalpingmusic\/","soundcloud":"https:\/\/soundcloud.com\/scalpingmusic","twitter":"https:\/\/twitter.com\/scalpingmusic","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Scalping.jpg"},{"id":114,"name":"Scavengers","description":"At the forefront of the South Wales alt rock scene, drawing in huge local crowds with ease, Scavengers are going to be going places very soon. It would be a good idea to see them in their infancy now before they rocket off to the moon for big big things. Latest single “Deadlock” has also caught the attention of big name magazines like ALT Corner and Discovered magazine, make sure they catch your attention this Sŵn Festival.","description_cy":"Ar ochr blaenaf y sin roc amgen De Cymru, yn tynnu cynulleidfaoedd enfawr yn hawdd, bydd Scavengers yn tyfu mewn enw cyn bo hir. Mae’n syniad da i’w weld nawr tra bod nhw’n enw ifanc, cyn iddynt rocedi i’r lleuad am bethau lot fwy. Mae’r sengl ddiweddaraf ‘Deadlock’ wedi ennill sylw cylchgronau mawr fel ALT Corner a Discovered Magazine, gwnewch siŵr bod nhw’n tynnu’ch sylw chi hefyd yng Ngŵyl Sŵn.","facebook":"https:\/\/www.facebook.com\/ScavengersUK\/","soundcloud":"https:\/\/soundcloud.com\/scavengersuk","twitter":"https:\/\/twitter.com\/ScavengersUK","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Scavengers.jpg"},{"id":115,"name":"Seazoo","description":"Both the cheeriest and the cheekiest band playing Sŵn this year, Wrexham’s Seazoo are seemingly designed for goofy smiles, via heartwarming, slightly wonky fuzz pop of the non-cheesy variety. Like Grandaddy judging a North Walian surfing contest, last year’s Trunks LP showed why festivals and 6Music sessions are fond of the ‘zoo: these songs are charming and joyous and made for mass listening.","description_cy":"Y band mwyaf hwyliog ag eofn sy’n chwarae Sŵn eleni, daw Seazoo o Wrecsam gyda’u gwenau goofy, trwy fuzz pop (non-cheesy) i dwymo’r galon. Nid dyma ymddangosiad cyntaf y band i’r wyl a mae hi’n bleser pur cael croesawu nhw nol!","facebook":"https:\/\/www.facebook.com\/seazooband\/","soundcloud":"https:\/\/soundcloud.com\/seazoo","twitter":"https:\/\/twitter.com\/seazooband","website":"http:\/\/seazooband.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Seazoo.jpg"},{"id":116,"name":"Self Esteem","description":"A very different person since leaving indie-folk band Slow Club, Self Esteem finds Rebecca Lucy Taylor’s magnetic presence to the forefront, creating brilliant, unnerving modernist pop music. Solo stardom is clearly where Taylor fits, and in the gliding melodies and stark beats, in the excellent self-directed, staring disarmingly into camera music videos, Self Esteem means to grab it wholeheartedly. Recent debut album Complements Please is a rush of pop star moments both classic and experimental, and, in The Best, contains at least one song that in a just world would be a worldwide goddamn hit.","description_cy":"Yn berson cwbwl gwahanol i’r person oedd yn y band werin amgen Slow Club, mae Self Esteem yn llwyfan i bresenoldeb magnetig Rebecca Lucy Taylor. Yn creu cerddoriaeth wych, fodern ac ysgytwol mae Taylor yn wefreiddiol wrth berfformio’n unigol. Ymysg y melodïau ysgafn a’r curiadau llwm mae’r artist unigol yn cofleidio pob cyfle i serennu. Wedi’i chyfarwyddo gan neb arall ond ei hun wrth syllu’n ddiarwybod mewn i’r camera mewn fideo cerddorol, mae Self Esteem yn hawlio pob perfformiad. Mae ei albym diweddaraf Compliments Please yn llawn caneuon gan seren bop – rheiny’n ganeuon pop-glasurol a chaneuon pop-arbrofol. Petai ni’n byw mewn byd cyfiawn byddai’r gân The Bestyn hit rhyngwladol – Ar fy llw mêt.","facebook":"https:\/\/www.facebook.com\/RLTSELFESTEEM\/","soundcloud":"https:\/\/soundcloud.com\/selfesteemofficial","twitter":"https:\/\/twitter.com\/SELFESTEEM___","website":"http:\/\/www.selfesteem.love","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Self-Esteem.jpg"},{"id":117,"name":"Shadowlark","description":"Carefully crafting rich, cinematic electro-pop, the newly-formed three-piece from Leeds, Shadowlark have burst onto the scene this year and we look forward to welcoming them to Cardiff in October. The trio come armed with moreish melodies, swimming through blankets of wistful synths that evokes fuzzy nostalgia – an atmosphere that feels right at home on a Lana Del Rey or Lorde album. ","description_cy":"Yn creu pop electro, cyfoethog a sinematig mae’r triawd newydd o Leeds Shadowlark wedi ffrwydro mewn i’r sîn eleni a rydym yn edrych ymlaen at eu croesawi i Gaerdydd yr Hydref hwn. Mae’r triawd yn llwyddo i greu melodïau blasus trwy nofio dros donnau o synth gan greu ymdeimlad o hiraeth fuzzy. Cawn awyrgylch tebyg i awyrgylch albym Lorde neu Lana Del Rey wrth wrando ar Shadowlark.","facebook":"https:\/\/www.facebook.com\/shadowlarkmusic\/","soundcloud":"https:\/\/soundcloud.com\/shadowlark","twitter":"https:\/\/twitter.com\/shadowlarkmusic","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Shadowlark.jpg"},{"id":118,"name":"She Drew The Gun","description":"Hailing from The Wirral, She Drew The Gun have soaked up the Merseyside psychedelia floating in those waters, but have added both pop soul and queer protest elements to their music. Led by the irrepressible Louisa Roach, SDTG gigs are equally likely to include impassioned poetry as shimmering melodies, a mix that’s inspired fierce devotion, as well as attracted the Coral’s James Skelly, drafted in to produce recent album Revolution Of Mind.","description_cy":"Yn wreiddiol o Wirral, mae She Drew The Gun wedi bod yn anadlu awyr seciadelic Merseyside wrth greu cerddoriaeth sy’n llawn cyfeiriadau at faterion cwiyr a pop soul. Wedi’u harwain gan Louis Roach, mae gigs SDTG yn debygol o gynnwys barddoniaeth angerddol fel prif alaw, sy’n gyfuniad gwych i ysbrydoli a thanio chwilfrydedd.","facebook":"https:\/\/www.facebook.com\/SheDrewTheGun\/","soundcloud":"https:\/\/soundcloud.com\/she-drew-the-gun","twitter":"https:\/\/twitter.com\/shedrewthegun","website":"http:\/\/www.shedrewthegun.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/She-Drew-The-Gun.jpg"},{"id":119,"name":"She Makes War","description":"A one-person industry, Bristol’s Laura Kidd is as comfortable strumming a ukulele as blasting an electric guitar, on songs covering the political or highly personal, or any point inbetween. Something of a cult icon for her fanbase, the Patreon-funded ‘Brace For Impact’ is album number four for Kidd, and follows collaborations with the likes of Tanya Donelly, backing band work for Tricky and Viv Albertine, and a one-woman stand up show at the Edinburgh festival. The songs remain transcendent though: poignant or celebratory, lushly orchestrated or starkly beautiful, She Makes War is a full force for good.","description_cy":"Diwydiant un person, mae Laura Kidd o Fryste’r un mor gyfforddus yn strymio ukele nag yw hi’n blastio gitâr electrig, gyda chaneuon sy’n trafod y gwleidyddol a’r personol ac unrhyw le rhyngddynt. Rhyw beth o eicon cwlt gyda’i chefnogwyr, ‘Brace For Impact’ yw bedwerydd albwm Kidd, ac yn dilyn cydweithrediadau gyda Tanya Donelly, Tricky a Viv Albertine, a sioe un-fenyw ‘stand up’ yng Ngŵyl Caeredin. Mae’r caneuon yn aros yn drosgynnol drwyddi draw: hudolus neu ddathliadol, wedi’i drefnu’n hyfryd neu’n blaen, yn hardd iawn, mae She Makes War yn rym cryf am dda.","facebook":"https:\/\/www.facebook.com\/SheMakesWar\/","soundcloud":"https:\/\/soundcloud.com\/shemakeswar","twitter":"https:\/\/twitter.com\/shemakeswar","website":"http:\/\/www.shemakeswar.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/She-Makes-War.jpg"},{"id":120,"name":"Sick Joy","description":"A Brighton-via-Newcastle trio ploughing a furrow through 90s grunge while injecting a little UK hard rock, Sick Joy are a strong brew of good times and glowering. Debut single ‘Smiling Shame’ should have tipped you off: four minutes of fierce trawling through Washington State swagger, while recent track ‘Dissolve Me’ crackles with the fever that someone like Mudhoney would be proud of. Twisted anthems cannot be far away.","description_cy":"Wedi eu geni yn Newcastle ond erbyn hyn yn byw yn Brighton, mae Sick Joy yn fand sy’n ysgrifennu penillion grynj-static a chytganau ffrwydroadol. Sicrhewch eich bod chi’n aros o gwmpas i glywed llais drydanol y prif leisydd, Mykl sy’n sicr o ddangos egni di-droi’n-ôl, ofnus a gafaelgar Sick Joy.","facebook":"https:\/\/www.facebook.com\/sickjoyband\/","soundcloud":"https:\/\/soundcloud.com\/sickjoyband","twitter":"https:\/\/twitter.com\/sickjoyband","website":"https:\/\/www.sickjoy.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Sick-Joy-1.jpg"},{"id":121,"name":"Silverbacks","description":"A ferocious live draw in Dublin’s increasingly packed array of hot new guitar bands, Silverbacks exist somewhere halfway between art rock and pub rock, a lairy, brainy and stylish menace. Their debut album, produced by Daniel Fox of Girl Band, should be one of 2019’s best, but on the already released material such as ‘Just In The Band’ their M.O. is clear – triple guitar interplay that recalls Television, Daniel O’Kelly’s not-quite-sung, not-quite-spoken utterings, and a general Parquet Courts-like loucheness that leaps from restrained to urgent and into collapse.","description_cy":"Yn wreiddiol o Ddulyn, mae Silverbacks yn gyffrous, gan eu bod yn cynnig roc dan ddylanwad Efrog Newydd yn ei ffordd unigryw a thrafferthus ei hun. Ar ôl stopio ysgrifennu caneuon yn eu hystafelloedd gwely, daeth y pump aelod at ei gilydd, gan gynnwys y dau frawd Killian a Daniel O’Kelly, i greu cerddoriaeth sydd â phwyslais enfawr ar eiriau doniol a sych Daniel gan ychwanegu gitars trwm ac egnïol ar eu pennau.","facebook":"https:\/\/www.facebook.com\/Silverbacks\/","soundcloud":"https:\/\/soundcloud.com\/silverbacks","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Silverbacks.jpg"},{"id":122,"name":"Skating Polly","description":"Oklahoman step-sibling trio, formed when Kelli was just 9 years old. Quickly picking up an impressive number of famous fans and collaborators (members of X and Veruca Salt, Calvin Johnson, Kliph Scurlock + many more) with a string of five excellent albums over the next intervening years. Musically they have naturally matured from raucous garage rock to timeless power-pop whilst lyrically they have always been way ahead of any of their peers.","description_cy":"Mae’n anodd digrifio Skating Polly, ond eto mae ansawdd rhai o’u caneuon yn uwch ac yn well na unrhyw genre na chyfnod. Dechreuodd y ddeuawd aml-offeryn, Kelli Meyo a Peuton Bighorse, yn Oklahoma yn 2009. Recordiwyd eu halbym gyntaf ‘Taking Over the World’ yn 2019 gan ddenu llwyth o sylw gan eicons tanddaearol fel Exene Cervenka o X. Ar ôl dod at ei gilydd mewn sesiwn sgwennu, datblygodd y cynnyrch hwnnw i fod yn EP ‘New Trick’ (2017). Gyda brawd Kelli Meyo – Kurtis Meyo – fel trydydd aelod, mae’r band ar fin rhyddhau eu halbym gyntaf The Make It All Show.","facebook":"https:\/\/www.facebook.com\/skatingpolly\/","soundcloud":"https:\/\/soundcloud.com\/skating-polly","twitter":"https:\/\/twitter.com\/SkatingPolly","website":"http:\/\/www.skatingpolly.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Skating-Polly.jpg"},{"id":123,"name":"Skinny Pelembe","description":"The fractured, otherwordly music of Doncaster-via-Johannesburg’s Doya Beardmore, Skinny Pelembe tunes wash over you beautifully, mixing hazy beats and scattered guitar notes with Beardmore’s meandering, hopscotching vocal style. Recently signed to Gilles Peterson’s Brownswood Recordings, Skinny Pelembe’s forthcoming debut album is firmly in the ‘hotly anticipated’ category, helped by recent single No Blacks, No Irish, No Dogs, and its willingness to fuse anti-discrimination vibes with insistent, nagging groove. Do not miss.","description_cy":"Mae cerddoriaeth arbennig, doredig Doya Beardmore, Skinny Pelembe o Doncaster-via-Johannesburg yn eich golchi yn ofalus gyda’r cyfuniad anhygoel o guriadau hyfryd, nodau gitâr wasgaredig a llais unigryw, chwareus Bearmore. Wedi’i arwyddo’n ddiweddar i gwmni recordio Gilles Peterson, Brownswood Recordings, mae albym cyntaf Skinny Pelembe yn y sefyll yn gadarn yn y categori ‘hir-ddisgwyliedig’ diolch i ‘No Blacks, No Irish, No Dogs’, a’i barodrwydd i asio teimladau gwrthwahaniaethol gyda grŵf sy’n mynnu ac yn nagio, mae’n rhaid i chi weld y gŵr yma.","facebook":"https:\/\/www.facebook.com\/skinnypelembe\/","soundcloud":"https:\/\/soundcloud.com\/skinnypelembe","twitter":"https:\/\/twitter.com\/SkinnyPelembe","website":"http:\/\/www.skinnypelembe.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Skinny-Pelembe.jpg"},{"id":124,"name":"Slagheap","description":"After making themselves unmistakably well heard over the chatter of Bristols music scene, Slagheap are bringing their catchy choruses and wonky garage pop sound to Sŵn Festival 2019.  Their iconic debut single “Power Shower” is everything you want it to be, catchy, tastefully hilarious, punk as hell and most importantly a massive dance number; and believe us when they say that their sound translates even better live and they might just be your new favourite band after the end of Sŵn weekend.","description_cy":"Ar ôl dod yn enw cyfarwydd yn y sîn gerddoriaeth ym Mryste, bydd Slagheap yn dod a’u caneuon catchy a’u sŵn garej pop i Wyl Sŵn 2019. Yn ei sengl eiconig cyntaf ‘Power Shower’ clywir gân sy’n chwaethus, catchy, doniol, pync ac yn bwysicach na dim byd, cân sydd am wneud i chi ddawnsio! Trystiwch ni, mae sŵn Slagheap hyd yn oed yn well yn fyw – efallai mai nhw bydd eich hoff fand ar ddiwedd benwythnos Sŵn…","facebook":"https:\/\/www.facebook.com\/slagheapband\/","soundcloud":"https:\/\/soundcloud.com\/slagheapbristol","twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Slagheap.jpg"},{"id":125,"name":"Social Contract","description":"A socially conscious gang of South Londoners, Social Contract tackle subjects like gentrification and political intolerance but come out swinging at the same time, guitars like battering rams. Latest single ‘Hoist Their Heads’ is their best yet: a squall of feedback and rumbling bass that resolves itself into a tight howl of urgency, vocalist Josh Eggerton’s careering wails adding another layer of intensity. They seem to wind it up a notch with each release, so get in early and hold on.","description_cy":"Ffurfiwyd Social Contract arlein gan Josh a Scott Roach tra bu Josh yn chwilio am dŷ yn Llundain. Gan fod cariad at gerddoriaeth yn gyffredin rhwng y ddau, dechreuon nhw ysgrifennu caneuon oedd yn adlewyrchu’r math o awyrgylch yr oedden nhw’n byw ynddi. Gyda’r bwriad o berfformio’n fyw, daethon nhw o hyd i ddau gerddor Bisqu Wemyss (drymiau) a Chris Coward (bass). Yn rhan o label Beatnik Creative, mae’r pedwarawd o Dde Llundain yn paratoi at ryddhau eu EP newydd ‘Common Tongue’ yn hwyrach yn y Gwanwyn, gan sicrhau mae nhw yw un o’r bandiau amgen mwyaf cyffrous sydd o gwmpas ar hyn o bryd.","facebook":"https:\/\/www.facebook.com\/socialcontractmusic\/","soundcloud":"https:\/\/soundcloud.com\/socialcontractband","twitter":"https:\/\/twitter.com\/socialcontractx","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Social-Contract.jpg"},{"id":126,"name":"Sonny Winnebago","description":"A new artist very much at the start of an exciting trajectory, Sonny Winnebago (formerly playing under his real name of Harvey Jones) has already locked in support from the Forte Project, an appearance at Focus Wales, and a choice support slot for Michael Kiwanuka. His music so far has been deliciously lilting melodies over accomplished acoustic guitar, though promised on forthcoming material are guest appearances from Sweet Baboo and Davey Newington of Boy Azooga. Get in at square one.","description_cy":"Er bod Sonny Wineebago (Harvey Jones o’r blaen) ar ddechrau ei daith cyffrous, mae’r cerddor newydd yma wedi derbyn cefnogaeth gan Prosiect Forte eleni ac wedi ymddangos yn Focus Wales a chefnogi Michael Kiwanuka. Mae ei gerddoriaeth hyd yn hyn wedi bod yn felodïau hyfryd gyda gitar acwstig yn gyfeiliant perffaith iddo. Mae wedi addo bydd ei ddeunydd newydd yn cynnwys Sweet Baboo a Davey Newington o Boy Azooga. Da. ","facebook":"https:\/\/www.facebook.com\/sonnywinnebago\/","soundcloud":"https:\/\/soundcloud.com\/sonnywinnebago","twitter":"https:\/\/twitter.com\/__harveyjones","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Sonny-Winnebago.jpg"},{"id":127,"name":"Squid","description":"A many-headed unit from Brighton, Squid sound deceptively ramshackle, occasionally on the verge of collapse, before snapping back into another taut party section. Taking the rattling post-punk rhythm of LCD Soundsystem and splurging over it sax and weird analogue bloops, Squid’s deranged blowouts are best heard on singles ‘Houseplants’ and ‘The Dial’, singing drummer Ollie Judge’s nervous breakdown vocals navigating dreamy and chaotic terrain. And you can dance to it too.","description_cy":"Rhyddhaodd y ffenomenom ôl-bync, disgo-ffync Squid eu sengl newydd o’r enw ‘Houseplant’ yn ddiweddar – mae’n dangos eu pŵer difrifol yn berffaith. Mae Squid yn adnabyddus am eu setiau byw, yn perfformio sets llawn egni, chaos ac anrhefn pur. Ar ôl perfformio mewn sawl gwŷl a chael cefnogaeth gan Radio 1, 6 Music a’u cynnwys yn The Guardian, The Quietus, NME a llawer mwy, mae 2019 yn argoeli’n dda iawn i Squid.","facebook":"https:\/\/www.facebook.com\/squiduk\/","soundcloud":"https:\/\/soundcloud.com\/squiduk","twitter":"https:\/\/twitter.com\/squidbanduk","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Squid.jpg"},{"id":128,"name":"Sunshine Frisbee Laserbeam","description":"If you’re looking for a fun and charming band to jump up and down to, belt a chorus to and sling beer at this Swn Festival, then you needn’t look any further than Sunshine Frisbee Laserbeam. As their ridiculous and frankly incredible name suggests, they’re just out to have fun, play some bangers and make sure everyone is having an 11\/10 time, 100% of the time. The Birmingham born garage rockers will definitely charm you with guitar heavy party bops galore and playful song themes. There’s little more to say other than this lot are just out for fun. If you want to have fun, go see Sunshine Frisbee Laserbeam.","description_cy":"Os ydych chi yng Ngwyl Sŵn eleni ac yn chwilio am fand hwyl a doniol sydd am wneud i chi neidio fyny ac i lawr a chyd-ganu pob un gair o bob cytgan gyda’r band, stopiwch, mae Sunshine Frisbee Laserbeam yma. Fel yr awgrymir eu henw bondigrybwyll, mae nhw yma i gael hwyl, chwarae tiwns a sicrhau bod pawb yn cael amser ARBENNIG – trwy’r amser.  Daw’r rocers garej doniol yma o Firmingham ac maent yn sicr o’ch swyno gyda’u bops gitar trwm a’u caneuon chwareus. Does dim angen dweud mwy, mae’r band yma yn barod i gael hwyl gyda chi yng Ngwyl Sŵn. ","facebook":"https:\/\/www.facebook.com\/sunshinefrisbeelaserbeam\/","soundcloud":"https:\/\/soundcloud.com\/sunshinefrisbeelaserbeam","twitter":"https:\/\/twitter.com\/SUNSHINEFRISBEE","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Sunshine-Frisbee-Laserbeam.jpg"},{"id":129,"name":"Super Marine","description":"Still at the mischievously teasing stage of their career, Super Marine may only have a few snippets of songs online, but even looking through that tiny keyhole you can spy what might be the next South Wales rock band to blow up massively. A four-piece from Blackwood, Super Marine\\’s determined, melodic rock and roll has already snagged support from the Forte Project, and nabbed production work from Pretty Viscious and 60 Ft Dolls helmsman Rich Jackson. Valleys Breakout 2019 starts here. ","description_cy":"Gyda dim ond pytiau byr o ganeuon ar gael, mae’r band yma o Dde Cymru yn barod wedi dal sylw Forte Project eleni ag yn gaddo codi i’r brig gyda’u cymysgedd penderfynol o roc a rol melodig ag agwedd uchelgeisiol. Ar hyn o bryd, mae’r band yn gweithio gyda Rich Jackson (60 Ft Dolls, Pretty Vicious) a ni methu aros i weld beth sydd ganddyn nhw i gynnig.","facebook":"https:\/\/www.facebook.com\/supermarineband\/","soundcloud":"https:\/\/soundcloud.com\/supermarineband","twitter":"https:\/\/twitter.com\/supermarineband","website":"https:\/\/www.supermarineband.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Super-Marine.jpg"},{"id":130,"name":"Swimming Tapes","description":"If the band name conjures up images of hazy bliss, then the music of Swimming Tapes does so doubly. A weightless shimmer of summery guitars and gentle vocals, ST tunes have a dreamy, transportive quality, all your stress and worries beam away to a warm field or coastal drive. Debut album ‘Morningside’ and its associated, retro-filtered videos best show their aesthetic – mellow indie vibes that fans of Radio Dept, Real Estate or Teenage Fanclub should flock towards.","description_cy":"Roedd gan Swimming Tapes agenda glir o’r diwrnod cyntaf. Ffurfiodd y band pan symudodd pedwar ffrind, Louis Price, Robbie Reid, Paddy Conn a Jason Hawthorne o Ogledd Iwerddon i Lundain a chwrdd â’r drymiwr, Andrew Evans. Wedi’i dylanwadu gan amryw o gerddorion, o felodïau ddiymdrech, hawddgar, hafaidd The Beach Boys i gymhlethdod gitars Real Estate, mae sŵn Swimming Tapes yn unigryw ac yn hollol ddigamsyniol.","facebook":"https:\/\/www.facebook.com\/swimmingtapes\/","soundcloud":"https:\/\/soundcloud.com\/swimmingtapes","twitter":"https:\/\/twitter.com\/swimming_tapes","website":"http:\/\/www.swimmingtapes.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Swimming-Tapes.jpg"},{"id":131,"name":"Tacet","description":"Online, the Cardiff trio, Tacet describe themselves as: Three-piece, dual vocal and single minded. This might sound simple, but the voyage Tacet take you on is far from that. The journey takes you from adventure rock (with added synth for atmosphere purposes) to roaming melodies and nimble guitar lines. Tubelord’s math-rock sharpness and yelping vocals, Deftones’ chilling whispers and a sprinkle of Myspace-era emo is all to be heard on their recent single In Colour.","description_cy":"Mae Tacet yn disgrifio’u hun fel: Three-piece, dual vocal and single minded. Efallai bod hyn yn swnio’n syml, ond mae’r daith mae Tacet yn dilyn yn bell o hyn. Mae nhw’n cymryd ni o rock anturus (gyda synths ar gyfer yr awyrgylch) at alawon sy’n crwydro rhwng llinellau gitars chwim. ","facebook":"https:\/\/www.facebook.com\/TacetUk\/","soundcloud":null,"twitter":null,"website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Tacet.jpg"},{"id":132,"name":"Telgate","description":"Keepers alive of a certain psychedelic glam flame in Cardiff, Telgate have become renowned in the capital for their stomping, theatrical live detonations. It’s giant rock shapes with a vital queer heart, taking in much guitar wigging, spacey blues rock and, in vocalist Casper, a frontperson whose full-body wailing conjures some amalgam of Lydia Lunch, Robert Plant and the Runaways, in six inch heels. Get a good dose.","description_cy":"Mae Telgate wedi cadw’r fflam seicadelig a glam yn fyw yng Nghaerdydd ers rhai blynyddoedd bellach, maent yn adnabyddus am eu gigs stompus a theatraidd. Yn creu sioeau roc enfawr gyda’u calonnau ciwyr holl-bwysig, gitars gwych a’u roc blŵs. Mae eu prif leisydd Casper yn llwyddo i greu perfformiadau tebyg i berfformiadau Lydia Lunch, Robert Plant a The Runaways – ond mewn sodlau 6 modfedd. Well i chi fynd i weld nhw ife? ","facebook":"https:\/\/www.facebook.com\/telgateuk\/","soundcloud":"https:\/\/soundcloud.com\/telgateuk","twitter":"https:\/\/twitter.com\/TelgateUk","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/09\/Telgate.jpg"},{"id":133,"name":"Threatmantics","description":"A constant oddball presence in Cardiff for over 10 years now, like a viola-aided Terminator, Threatmantics just will not stop. Having evolved gradually through those years, the line up now seems settled on Heddwyn, Huw, Andrew and Graf, and a ramshackle approach to oblique rock and roll thrills, one that hops between backwoods folk tales, careering viola drone and crashing guitar thrash. Picking up a copy of their new album Shadow On Your Heart, lovingly screen-printed by hand, at this gig will confirm all of this: Threatmantics are uncategorisable weirdos, and should be cherished.","description_cy":"Gyda presenoldeb cyson a chryf yma yng Nghaerdydd am dros 10 mlynedd, fel Terminator gyda help y fiola, ni fydd Threatmantics yn stopio. Byth. Ers esblygu’n raddol dros y blynyddoedd, mae’r lein-yp wedi setlo nawr ar Heddwyn, Huw, Andrew a Graf, a mae nhw’n llwybro’u ffordd gyda roc a rôl ramshackle sy’n neidio rhwng chwedlau gwerin, drôn fiola a thrash gitâr. ","facebook":"https:\/\/www.facebook.com\/Threatmantics\/","soundcloud":"https:\/\/soundcloud.com\/threatmantics","twitter":"https:\/\/twitter.com\/threatmantics","website":"http:\/\/threatmantics.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Threatmantics.jpg"},{"id":134,"name":"Thyla","description":"Hailing from Brighton, where every single human being, and some of their pets, is in a band, Thyla stand out through their dream pop being a little more intense, a little more belting than most. A wall of crashing guitars cloak Millie Duthie’s powerful vocals, backed by a rhythm section able to smash things to space when necessary. A beast of music able to switch from shimmering beauty to towering sound at each moment. ","description_cy":"Yn dod o Brighton, lle mae pob un bod dynol, a rhai o’u hanifeiliaid anwes, mewn band, mae Thyla yn sefyll allan gyda’u pop breuddwydiol sydd bach fwy dwys na’r gweddill. Wal o gitârs sy’n crashio ar draws llais pwerus Millie Duthie, ac adran rythm sy’n chwalu popeth i’r gofod pan bod angen.","facebook":"https:\/\/www.facebook.com\/thylamusic\/","soundcloud":"https:\/\/soundcloud.com\/thyla_music","twitter":"https:\/\/twitter.com\/ThylaMusic","website":"https:\/\/www.thyla.co.uk\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Thyla-1.jpg"},{"id":135,"name":"Tiny Deaths","description":"A Minneapolis duo of Claire De Lune on honeyed vocals and limelight-shy producer Grant Butler, Tiny Deaths electro-pop is decadent, plush and expansive. Conjuring up similar dreamy sounds to Beach House or Poliça, the two TD albums so far also take detours into more playful territory, with songs like Always almost like soundtracks to alternate universe ‘80s film soundtracks. Either way, spells will be conjured.","description_cy":"Claire De Lune sy’n canu a’r cynhyrchydd swil Grant Butler, yw’r ddeuawd o Minneapolis. Mae electro-pop Tiny Deaths yn benderfynol, yn foethus ac yn amrywiol. Yn debyg i sŵn Beach House neu Polica, mae’r ddwy albym gan Tiny Deaths yn ein harwain at dirwedd fwy chwareus gyda chaneuon fel Always yn debyg i soundtrack ffilm amgen o’r 8au. ","facebook":"https:\/\/www.facebook.com\/tinydeaths\/","soundcloud":"https:\/\/soundcloud.com\/tinydeathsband","twitter":null,"website":"http:\/\/tinydeaths.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Tiny-Deaths-1.jpg"},{"id":136,"name":"Tom Ravenscroft (DJ Set)","description":"Long established as part of BBC 6 Music’s team of presenters, in the section marked ‘find new and weird tunes for people to hear’, Tom Ravenscroft’s DJ sets are like his regular radio broadcasts: a space to celebrate the stuff that just doesn’t fit anywhere else; the noisy, dissonant, unique music that you know is out there and always keeps you looking. Whether that’s outsider hip-hop, detuned electronica or mad footwork from Uganda (we humbly request something on Nyege Nyege Tapes), you’ll be glad you were introduced.","description_cy":"Mae Tom yn cyflwyno’i gerddoriaeth wych i wrandawyr o gwmpas y byd trwy sawl prosiect, gan gynnwys ei raglen rheolaidd am 9 o’r gloch ar nos Wener, a’i raglen Recommends ar BBC Radio 6 Music. Yn arddangos cerddoriaeth wedi’u dewis yn ofalus o bob cwr o’r byd ac yn eu rhoi gyda’i gilydd mewn mix arbennig i greu cawl o synau gwahanol ac eclectig.","facebook":null,"soundcloud":"https:\/\/soundcloud.com\/tomravenscroft","twitter":"https:\/\/twitter.com\/tom_ravenscroft","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Tom-Ravenscroft.jpg"},{"id":137,"name":"Trudy & the Romance","description":"Formed in Liverpool in 2016, Trudy & The Romance have come a long way since becoming renowned for their take on gentlemanly, ‘50s crooner rock and roll. Now expanded to a full on 6-piece, 2019’s debut album Sandman throws near-everything into their mix: pedal steel, harp, Deserters Songs-era Mercury Rev-style strings, multipart harmonies and doo-wop classiness. They’re still a rock and roll band though, just one existing in an epic, out-of-time wormhole.","description_cy":"Wedi’i ffurfio yn Lerpwl yn 2016, mae Trudy & The Romance wedi dod yn bell ers ennill enwogrwydd am eu fersiwn o roc a rôl crwner y 50au. Nawr yn fand 6-aelod, mae’r albwm cyntaf Sandman yn taflu bron popeth yn y gymysgedd: pedal dur, y delyn, llinynnau steil Mercury Rev, harmonïau amlran a chlasurdeb dw-wop. ","facebook":"https:\/\/www.facebook.com\/trudymylove\/","soundcloud":"https:\/\/soundcloud.com\/trudymylove","twitter":"https:\/\/twitter.com\/trudymylove","website":"https:\/\/www.trudymylove.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Trudy-and-the-Romance.jpg"},{"id":138,"name":"Twin Peaks","description":"Their website has the address twinpeaksdudes.com, which might give you an indication of the easy-going, good-times vibes on offer here. Formed in Chicago by a bunch of youngsters, Twin Peaks quickly turned heads by blazing through house parties and home recordings split between sloppy garage rock and deceptively touching power pop. As seen in their charmingly lo-fi music videos, Twin Peaks are a band as comfortable chugging beer as writing love letters, half Replacements, half Stones, and all killer. ","description_cy":"Gwefan Twin Peaks yw twinpeaksdudes.com, sy’n rhoi syniad i chi o’r vibes ymlaciol, hapus a phositif sydd ar gael gan y band yma. Wedi’i ffurfio yn Chicago gan griw o bobl ifanc, dechreuodd Twin Peaks greu cyffro a chynnwrf wrth berfformio mewn house-parties gyda’u sŵn sy’n gyfuniad perffaith o roc garej a pop twyllodrus a phwerus. Fel y gwelir yn eu fideos cerddoriaeth lo-fi swynol, mae Twin Peaks yn fand sy’n gyfforddus wrth lowncio cwrw ac ysgrifennu llythyron cariad, weithiau’n Replacements, weithiau’n Stones, weithiau’n Killers ond eto’n 100% Twin Peaks.","facebook":"https:\/\/www.facebook.com\/twinpeaksdudes\/","soundcloud":"https:\/\/soundcloud.com\/twinpeaksdudes","twitter":"https:\/\/twitter.com\/twinpeaksdudes","website":"https:\/\/twinpeaksdudes.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Twin-Peaks.jpg"},{"id":139,"name":"Vistas","description":"The fresh young sound of Edinburgh, in perma-touring indie pop form. Vistas are three young men who write devilishly catchy up-tempo powerhouses, notable both for their unflagging rhythms and Prentice Robertson’s birdlike, fluttering falsetto notes. Latest single Eighteen is another boisterous belter, showing why they’re moving from hot tour support to hot tour sellouts.","description_cy":"Cyflwynir i chi sŵn ifanc a newydd o Gaeredin – Vistas yw’r tri dyn ifanc sy’n ysgrifennu caneuon pwerus, bywiog a catchy gyda llais ffalseto arbennig Plike Robertson. Mae ei sengl ddiweddaraf Eighteen yn gân syfrdanol arall, yn profi pam eu bod yn symud o fand sy’n cefnogi i fand sy’n teithio o gwmpas y byd. ","facebook":"https:\/\/www.facebook.com\/vistasband\/","soundcloud":"https:\/\/soundcloud.com\/vistasmusic","twitter":"https:\/\/twitter.com\/vistasmusic","website":"http:\/\/www.vistasmusic.com\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Vistas.jpg"},{"id":140,"name":"We Were Promised Jetpacks","description":"Longstanding members of the Glasgow music scene, having moved there from Edinburgh just after forming, We Were Promised Jetpacks are currently celebrating 10 years of their classic album These Four Walls, via a humongous North America and Europe tour. Beloved thanks to its crunchy guitar work, fierce college rock hooks and strident, strong-accented vocals, it’s an album that only acts as a starting point for a range of material through the years, on FatCat and Big Scary Monsters, tackling knotty emotions in sing-it-out-loud style.","description_cy":"Aelodau hirsefydlog o’r sîn gerddorol yn Glasgow, ar ôl symud yno o Edinburgh ddim yn hir ar ôl ffurfio, mae We Were Promised Jetpacks yn dathlu 10 mlynedd o’u albwm clasurol These Four Walls ar hyn o bryd, wrth fynd ar daith ar draws Gogledd America ac Ewrop. Yn annwyl a gwerthfawr i’w grandawyr ffyddlon, diolch i’r gitarau crensiog, bachau roc coleg ffyrnig, acenion cryf, mae’n albwm sydd yn actio fel pwynt dechreuol i’r amryw o ddeunydd anhygoel ar draws y blynyddoedd.","facebook":"https:\/\/www.facebook.com\/wewerepromisedjetpacks\/","soundcloud":"https:\/\/soundcloud.com\/wewerepromisedjetpacksofficial","twitter":"https:\/\/twitter.com\/wwpj","website":"http:\/\/www.wewerepromisedjetpacks.co.uk\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/We-were-promised-jetpacks.jpg"},{"id":141,"name":"Working Men’s Club","description":"Old heads on young shoulders with Working Men’s Club, as their cocksure swagger meets the ghosts of the febrile post-punk era. A just-out-of-their-teens gang from Todmorton, debut single ‘Bad Blood’ shows fierce promise, as clipped drum machine underpins tight, repetitive guitar lines, with Sydney Minsky-Sargeant’s semi-spoken drawl recalling Mark E Smith or Lou Reed at their most sardonic. An intense, bruising workout.","description_cy":"Daw Syd a Jake o Todmorden a Hebden Bridge, a theuluoedd y ddau yn dod o Wlad Pwyl, tra bod Giulia yn dod o Lake Garda, yr Eidal. Heb os felly mae aml-gendlaetholdeb yn hynod o bwysig i’r band ar ôl cwrdd yng ngholeg ym Manceinion. Gyda’r grŵf The Knack-aidd a llafar-ganu Syd sy’n torri trwy’r llinellau gitar Strokes-aidd a dylanwadau Mark E Smith yn llusgo trwy’r caneuon, cawn deimlad byw o dreulio ddydd Sadwrn yn prowlian mewn siopau thrift a hongian o gwmpas y lle gyda ffrindiau.","facebook":"https:\/\/www.facebook.com\/WorkingMensClubb\/","soundcloud":"https:\/\/soundcloud.com\/workingmensclub-music","twitter":"https:\/\/twitter.com\/work1ngmensclub","website":"http:\/\/heavenlyrecordings.com\/artist\/working-mens-club\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Working-Mens-Club.jpg"},{"id":142,"name":"Wych Elm","description":"Their single comes sealed inside a replica body bag. Song titles include School Shooter and Help Me. Happy scamps Wych Elm are another disgustingly young band in Bristol’s fetid scene, and newest EP Rat Blanket is a squall of noise and slacker moves, with Caitlin Elliman’s vocals jumping from slow and hazy to harsh and psychotic like a twitchy serial killer. They are Kim Deal in the Breeders AND the Pixies i.e. look out.","description_cy":"Mae eu sengl yn cyrraedd o fewn replica ‘body bag’. Teitlau caneuon yn cynnwys School Shooter a Help Me. Mae’r scamps hapus Wych Elm yn fand ifanc eto o sîn Bryste, gyda’r EP diweddaraf, Rat Blanket yn hwrdd o sain a symudiadau slacker, gyda llais Caitlin Elliman yn neidio o araf a niwlog i llym a seicotig fel llofrudd cyfresol. Wych Elm yw Kim Deal yn y Pixies a’r Breeders. Peryglus. Edrychwch allan.","facebook":"https:\/\/www.facebook.com\/wychelm666\/","soundcloud":"https:\/\/soundcloud.com\/wychelm666","twitter":"https:\/\/twitter.com\/666wychelm","website":"https:\/\/www.wychelm.co.uk\/","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/04\/Wych-Elm.jpg"},{"id":143,"name":"Ynys","description":"Radio Luxembourg \/ Race Horses founding member Dylan Hughes finally re-appeared earlier this year with his first recording in far too long, released on the excellent Libertino label. “Caneuon” showcases his keen ear for richly harmonious but sweetly off kilter psychedelic pop melodies that fans of his previous bands earlier works will instantly recognise, savour and welcome back into both their ears and hearts. ","description_cy":"Prosiect newydd Dylan Hughes (gynt o Race Horses) yw Ynys. Mae gwrando ar Ynys yn teimlo fel mynd ar bererindod braf, mewn car vintage llawn mixtapes seicadelig, meddal a hiraethus. Mae’r casgliad newydd yma o ganeuon yn seiliedig ar gannoedd o syniadau nath Dylan recordio gyda’i lais dros y pedwar mlynedd diwethaf. Mae dawn Dylan Hughes i ddyfeisio alawon perffaith yn dod i’r amlwg wrth wrando ar unrhywbeth mae wedi recordio, a mae’r aros hir am gerddoriaeth newydd gan yr artist yma wedi bod werth bob eiliad.","facebook":"https:\/\/www.facebook.com\/YnysMusic\/","soundcloud":"https:\/\/soundcloud.com\/libertinorecords","twitter":"https:\/\/twitter.com\/YnysMusic","website":null,"image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Ynys.jpg"},{"id":144,"name":"Zooni","description":"Barely a few songs old in online terms, Brighton’s Zooni have already caught the ear of the Square Leg label (run by Alt-J producer Charlie Andrew), and debut single ‘Pany’ begins to illustrate why. A tremulous wash of piano and drum skitter, topped with gentle, high-pitched crooning, it’s a swoon of delicate beauty. Further tracks such as ‘Haze’ add in gorgeous folk touches, and show Zooni’s range: a treat of varied, cinematic lushness.","description_cy":"Cyflwynir Zooni i chi – band gelf pop o Brighton sydd â chymysgedd pwerus ond tyner o eiriau barddonol a gwaedau arallfydol. Golchir curiadau hypnotig gan nodau piano tyner a gitar onglog gan Peter Martin, George Godwin, Ben Clark a Matt Glasbey. Mae’r band wedi creu enw da i’w hunain am eu sioe byw atmosfferig, gan greu fformat newydd a diddorol i roc amgen. Maent yn llwyddo i blethu Nick Drake, Grizzly Bear a Portishead. ","facebook":"https:\/\/www.facebook.com\/zooniband\/","soundcloud":"https:\/\/soundcloud.com\/zooniband","twitter":"https:\/\/twitter.com\/zooniband","website":"https:\/\/zooni.org","image_url":"http:\/\/swnfest.com\/wp-content\/uploads\/2019\/06\/Zooni.jpg"}]